[
  {
    "id": "2105.09896v3::L32-188::c0",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 32,
    "end_line": 188,
    "text": "C[1]>p#1\n\n[table]skip=10pt\n\ntheoremTheorem[section]\nlemma[theorem]Lemma\nproposition[theorem]Proposition\ncorollary[theorem]Corollary\nassumption[theorem]Assumption\n\ndefinition\ndefinition[theorem]Definition\nexample[theorem]Example\nremark\nremark[theorem]Remark\nnotation[theorem]Notation\n\nequationsection\n\nblue\n\nZ\nN\nR\nC\nH\nH_\nL\nL_\nJ\nP\nP_\nP_G\nId\nProj\n\nSpectral decimation of a self-similar version of almost Mathieu-type operators\n\nGamal Mograby\nMathematics Department, University of Maryland, College Park, MD 20742-4015 , USA\n\ngmograby@umd.edu, gamal.mograby@uconn.edu\n\nRadhakrishnan Balu\nRadhakrishnan Balu, Department of Mathematics  Norbert Wiener Center for\nHarmonic Analysis and Applications, University of Maryland, College Park, MD 20742, USA\nradhakrishnan.balu.civ@mail.mil\n\nKasso A. Okoudjou\nKasso A. Okoudjou, Mathematics Department, Tufts University, Medford, MA 02155, USA\nkasso.okoudjou@tufts.edu\n\nAlexander Teplyaev\nAlexander Teplyaev, Mathematics  Physics Department, University of Connecticut, Storrs, CT 06269, USA\nalexander.teplyaev@uconn.edu\n\n[2010]81Q35, 81Q10, 47B93, 47N50, 47A10\n\nAlmost Mathieu Operator, Self-similar graphs and fractals, Spectral decimation, Singular continuous spectrum",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L191-201::c1",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L191-201::c1",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 191,
    "end_line": 201,
    "text": "Almost Mathieu Operator, Self-similar graphs and fractals, Spectral decimation, Singular continuous spectrum\n\nWe introduce and study self-similar versions of the one-dimensional almost Mathieu operators. Our definition is based on a class of self-similar Laplacians instead of the standard discrete Laplacian, and  includes the classical almost Mathieu operators as a particular case. Our main result establishes that the spectra of these  self-similar almost Mathieu operators can be described by the spectra of the corresponding  self-similar Laplacians through the spectral decimation framework used in the context of spectral analysis on fractals. The spectral type of the self-similar Laplacians used in our model are singularly continuous. The self-similar almost Mathieu operators also have singularly continuous spectrum for specific parameters. In addition, we derive an explicit formula of the integrated density of states of the self-similar almost Mathieu operators as the weighted pre-images of the balanced invariant measure on a specific Julia set.\n\nIntroduction\nThe investigation of the properties of quasi-periodic Schrodinger-type operators remains very active drawing techniques from different areas of mathematics and physics.\nThe special case of the almost Mathieu operators (AMO)  can be traced back to Harper who proposed a model to describe crystal electrons in a uniform magnetic field. Subsequently, Hofstadter observed that the spectra of the AMO can be fractal sets. We refer to for more early examples of such operators whose spectra are Cantor-like sets, and to\nfor more results on the AMO and references therein.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L32-188::c0",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L203-212::c2",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L203-212::c2",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 203,
    "end_line": 212,
    "text": "Introduction\nThe investigation of the properties of quasi-periodic Schrodinger-type operators remains very active drawing techniques from different areas of mathematics and physics.\nThe special case of the almost Mathieu operators (AMO)  can be traced back to Harper who proposed a model to describe crystal electrons in a uniform magnetic field. Subsequently, Hofstadter observed that the spectra of the AMO can be fractal sets. We refer to for more early examples of such operators whose spectra are Cantor-like sets, and to\nfor more results on the AMO and references therein.\n\nIndependently,  a line of investigations of self-similar Laplacian operators on graphs, fractals, and networks has emerged. A fundamental tool in this framework is the spectral decimation method, initially  used in physics to compute the spectrum of the Laplacian on a Sierpinski lattice. At the heart of this method is the fact that  the spectrum of this Laplacian  is completely described in terms of iterations of a rational function. For an overview of the modern mathematical approaches, applications, and extensions of the spectral decimation methods we refer to  and references therein.\n\nRecently, Chen and Teplyaev used the general framework of the spectral decimation method to investigate the appearnce of the singular continuous spectrum of a family of Laplacian operators. One of the   ideas used in establishing this result is that these Laplacians are naturally related to self-similar operators  with corresponding self-similar structures which allows to use complex dynamics techniques.\n\nThe present paper is a first in what we expect to be a research program dealing with quasi-periodic Schrodinger-type operators  on self-similar sets such as fractals and graphs.  Our goal is to initiate the study of  a generalization of the discrete almost Mathieu operators for self-similar situations.\nIn this paper we begin by considering  finite or half-integer one-dimensional lattices endowed with   particular self-similar structures.\nMore general Jacobi matrices  will be considered in the forthcoming work .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L191-201::c1",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L214-217::c3",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L214-217::c3",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 214,
    "end_line": 217,
    "text": "The present paper is a first in what we expect to be a research program dealing with quasi-periodic Schrodinger-type operators  on self-similar sets such as fractals and graphs.  Our goal is to initiate the study of  a generalization of the discrete almost Mathieu operators for self-similar situations.\nIn this paper we begin by considering  finite or half-integer one-dimensional lattices endowed with   particular self-similar structures.\nMore general Jacobi matrices  will be considered in the forthcoming work .\n\nIn this setting, the self-similar almost Mathieu operators (s-AMO) are formally defined in eq:AMOversionPQ  and will be denoted  by , for  ,  and .\nAs we will show, these operators can be viewed  as limits of finite dimensional analogues that can be completely understood using the spectral decimation methods developed by Malozemov and Teplyaev. Furthermore, the s-AMO we consider, are defined in terms of self-similar Laplacians  which are given by pLaplace. This class of self-similar Laplacians was first investigated in and arises naturally when studying the unit-interval endowed with a particular fractal measure, see also the related work.\nMoreover, when , then the self-similar almost Mathieu operators coincide up to a multiplicative constant with the standard one-dimensional almost Mathieu operators (see ()). Whereas, in the case of AMO when the magnetic flux is a fraction the resulting spectrum is absolute continuous,  the fractal case\ndisplays a spectrum that is singular continuous.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L203-212::c2",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L220-220::c4",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L220-220::c4",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 220,
    "end_line": 220,
    "text": "In this setting, the self-similar almost Mathieu operators (s-AMO) are formally defined in eq:AMOversionPQ  and will be denoted  by , for  ,  and .\nAs we will show, these operators can be viewed  as limits of finite dimensional analogues that can be completely understood using the spectral decimation methods developed by Malozemov and Teplyaev. Furthermore, the s-AMO we consider, are defined in terms of self-similar Laplacians  which are given by pLaplace. This class of self-similar Laplacians was first investigated in and arises naturally when studying the unit-interval endowed with a particular fractal measure, see also the related work.\nMoreover, when , then the self-similar almost Mathieu operators coincide up to a multiplicative constant with the standard one-dimensional almost Mathieu operators (see ()). Whereas, in the case of AMO when the magnetic flux is a fraction the resulting spectrum is absolute continuous,  the fractal case\ndisplays a spectrum that is singular continuous.\n\nThe paper is organized as follows. In Section  we introduce the notations and the definition of the self-similar structure we impose on the half-integer lattice.  In the first part of Section , we focus on the discrete and finite s-AMOs and describe their spectra using the spectral decimation method, see Section . Subsequently,  in Section  we prove one of our main results, Theorem , which states that the spectra of the AMO on  can be completely described using the spectral decimation method when the parameter  belongs to a dense set of numbers.  Moreover,  these operators have purely singularly continuous spectra when .  As will be seen, Theorem   provides a useful algebraic tool to relate the spectra of the almost Mathieu operators   to that of the family of self-similar Laplacians . In Section ,  using the fact that the spectrum of a self-similar Laplacian  is the Julia set  of a polynomial (defined in  eq:specDeciFuncLap), we derive in Theorem  an explicit formula for the density of states of   by identifying it with the weighted pre-images of the balanced invariant measure on the Julia set  .  As a corollary, we obtain a gaps labeling statement for  . In Section  we present some numerical simulations pertaining the spectra of the s-AMO as well as the integrated density of states for a variety of parameters.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L214-217::c3",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L223-223::c5",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L223-223::c5",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 223,
    "end_line": 223,
    "text": "The paper is organized as follows. In Section  we introduce the notations and the definition of the self-similar structure we impose on the half-integer lattice.  In the first part of Section , we focus on the discrete and finite s-AMOs and describe their spectra using the spectral decimation method, see Section . Subsequently,  in Section  we prove one of our main results, Theorem , which states that the spectra of the AMO on  can be completely described using the spectral decimation method when the parameter  belongs to a dense set of numbers.  Moreover,  these operators have purely singularly continuous spectra when .  As will be seen, Theorem   provides a useful algebraic tool to relate the spectra of the almost Mathieu operators   to that of the family of self-similar Laplacians . In Section ,  using the fact that the spectrum of a self-similar Laplacian  is the Julia set  of a polynomial (defined in  eq:specDeciFuncLap), we derive in Theorem  an explicit formula for the density of states of   by identifying it with the weighted pre-images of the balanced invariant measure on the Julia set  .  As a corollary, we obtain a gaps labeling statement for  . In Section  we present some numerical simulations pertaining the spectra of the s-AMO as well as the integrated density of states for a variety of parameters.\n\nA first illustration of our numerical results is Figure . The left panel of the figure shows a Hofstadter butterfly for a self-similar almost Mathieu operator corresponding to -Laplacian.  For comparison, the Hofstadter butterfly corresponding to  the standard  AMO is shown in the right panel. In both cases, the spectrum is plotted (-axis) for the fixed parameters   and  while varying  (y-axis). For all  where , Theorem  describes the difference in these two figures as a transformation given by a spectral decimation function. Note that in the  standard  AMO case, corresponding to  in our formulation, many important results are also obtained  for  irrational, but in the fractal setting the methods for irrational  are not developed yet.  Figure  depict examples corresponding to the case of an irrational .  The spectrum of  is plotted (-axis) for the fixed parameters  and  while varying  (y-axis).",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L220-220::c4",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L231-260::c6",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L231-260::c6",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 231,
    "end_line": 260,
    "text": "A first illustration of our numerical results is Figure . The left panel of the figure shows a Hofstadter butterfly for a self-similar almost Mathieu operator corresponding to -Laplacian.  For comparison, the Hofstadter butterfly corresponding to  the standard  AMO is shown in the right panel. In both cases, the spectrum is plotted (-axis) for the fixed parameters   and  while varying  (y-axis). For all  where , Theorem  describes the difference in these two figures as a transformation given by a spectral decimation function. Note that in the  standard  AMO case, corresponding to  in our formulation, many important results are also obtained  for  irrational, but in the fractal setting the methods for irrational  are not developed yet.  Figure  depict examples corresponding to the case of an irrational .  The spectrum of  is plotted (-axis) for the fixed parameters  and  while varying  (y-axis).\n\nWe end this introduction with a perspective on a general framework underlying the present paper.\nIn a  forthcoming and companion paper, we  identify a class of Jacobi operators that extend the present results to almost Mathieu operators  defined in the fractal setting. We refer to this class of operators as piecewise centrosymmetric Jacobi operators .\nIn this general setting we show that the spectral decimation function arises from a  particular system of orthogonal polynomials associated with the aforementioned Jacobi matrix. In particular, this spectral decimation function is computable using a three-term recursion formula associated to this system of orthogonal polynomials. In the process, we avoid the Schur complement computation that could involve resolvent calculations of large matrices. Additionally, the general setting we consider incan be further extended to higher-dimensional graphs and would allow us to define Jacobi-type operators on graphs like the Sierpinski lattices or Diamond graphs. We plan to use this approach to investigate some of the questions in.\n\nSelf-similar Laplacians and almost Mathieu operators In this section we introduce the notations and the definition of the self-similar structure we impose on the half-integer lattice. This self-similar structure describes a random walk on the half-line and gives rise to a class of self-similar probabilistic graph Laplacians . Moreover, it provides a natural finite graph approximation for the half-integer lattice. Regarding an almost Mathieu operator as a Schrodinger-type operator of the form  (where  is a potential operator), allows us to define the class of self-similar almost Mathieu operators as .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L223-223::c5",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L264-290::c7",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L264-290::c7",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 264,
    "end_line": 290,
    "text": "Self-similar Laplacians and almost Mathieu operators In this section we introduce the notations and the definition of the self-similar structure we impose on the half-integer lattice. This self-similar structure describes a random walk on the half-line and gives rise to a class of self-similar probabilistic graph Laplacians . Moreover, it provides a natural finite graph approximation for the half-integer lattice. Regarding an almost Mathieu operator as a Schrodinger-type operator of the form  (where  is a potential operator), allows us to define the class of self-similar almost Mathieu operators as .\n\nSelf-similar  Laplacians on the half-integer lattice\nWe consider a family of  self-similar Laplacians on the integers half-line. This class of Laplacians was first investigated in and arises naturally when studying the unit-interval endowed with a particular fractal measure. For more on this Laplacian and some related work we refer to . The Laplacian's spectral-type was investigated in,  where the emerging of singularly continuous spectra was proved. Furthermore, this class of Laplacians serves as a toy model for generating singularly continuous spectra. In this section, we   introduce the -Laplacians and review some of its properties that will be needed to state and prove our results, and refer to  for more details. We also introduce a corresponding self-similar structure on the half-integer line.\n\nLet  be the set of nonnegative integers and  be the linear space of complex-valued sequences . Let , for each , we define  to be the largest natural number  such that  divides . For  we define a self-similar Laplacian  by,\n\nWe equip   with its canonical basis   where\n\nThe matrix representation of   with respect to the canonical basis has the following Jacobi matrix\n\nThe case  recovers the classical one-dimensional Laplacian (probabilistic graph Laplacian).\n\nWe adopt the notation used to describe a random walk on the half-line with reflection at the\norigin and refer to the off-diagonal entries in  by the transition probabilities\n\nLet  be a -finite measure on . We define the Hilbert space\n*\nLet  , the (-th) Wronskian of  is given by\n\nLet  and . Assume that the measure  satisfies the reversibility condition, i.e.,  holds for every  . Then the discrete Green's second identity holds. That is, we have:\n\nMoreover,  the operator  is a bounded self-adjoint operator on .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L231-260::c6",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L293-330::c8",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L293-330::c8",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 293,
    "end_line": 330,
    "text": "Moreover,  the operator  is a bounded self-adjoint operator on .\n\nDirect computation gives for ,\n*\nUsing the reversibility condition, i.e. , we obtain\n*\nFor , we compute\n*\nHence, a telescoping trick gives\n*\nFor , we imply .\n\nWe regard the integers half-line  endowed with  as a hierarchical or substitution infinite graph, see for more details. We define a sequence of finite directed weighted graphs , such that  is constructed inductively according to a substitution rule. We set  for all , where   is the graph shown in Figure  (Left). We illustrate the substitution rule by constructing  shown in Figure  (Right).  We first introduce the protograph shown in Figure , which consists of the four vertices . We insert three copies of  in the protograph according to the following rule. Between any two vertices  and , we substitute the three dots with a copy of , identifying the vertex  in  with the vertex , and the vertex  in  with the vertex .  We substitute the edges  and  in  with the corresponding directed weighted edges as indicated in the protograph, see Figure . We repeat the procedure and insert copies of  between the vertices, , , then  ,  and finally , . The resulting linear directed weighted graph is denoted by , Figure  (Right). The graph  consists of  vertices, which we rename to , so that  corresponds to the vertex ,  to  ,  to  and  to . In particular, this gives  and  can be viewed as a truncation of  (regarded as a hierarchical infinite graph) to the vertices , whereby a reflecting boundary condition is imposed on the vertex .\nSimilarly, we construct  by inserting  in the protograph, see Figure .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L264-290::c7",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L332-374::c9",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L332-374::c9",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 332,
    "end_line": 374,
    "text": "We regard the integers half-line  endowed with  as a hierarchical or substitution infinite graph, see for more details. We define a sequence of finite directed weighted graphs , such that  is constructed inductively according to a substitution rule. We set  for all , where   is the graph shown in Figure  (Left). We illustrate the substitution rule by constructing  shown in Figure  (Right).  We first introduce the protograph shown in Figure , which consists of the four vertices . We insert three copies of  in the protograph according to the following rule. Between any two vertices  and , we substitute the three dots with a copy of , identifying the vertex  in  with the vertex , and the vertex  in  with the vertex .  We substitute the edges  and  in  with the corresponding directed weighted edges as indicated in the protograph, see Figure . We repeat the procedure and insert copies of  between the vertices, , , then  ,  and finally , . The resulting linear directed weighted graph is denoted by , Figure  (Right). The graph  consists of  vertices, which we rename to , so that  corresponds to the vertex ,  to  ,  to  and  to . In particular, this gives  and  can be viewed as a truncation of  (regarded as a hierarchical infinite graph) to the vertices , whereby a reflecting boundary condition is imposed on the vertex .\nSimilarly, we construct  by inserting  in the protograph, see Figure .\n\nLet   be the graph shown in Figure  (Left). We define the sequence of graphs  inductively. Suppose  is given for some integer , where . The graph  is constructed according to the following substitution rule. We repeat the following steps for :\n\nInsert a copy of  between the two vertices  and  of the protograph shown in Figure  in the following sense. We identify the vertex  in  with the vertex  and similarly, we identify the vertex  in  with the vertex .\nWe substitute the edges  and  in   with the corresponding directed weighted edges as indicated in the protograph, see Figure .\nThe resulting linear directed weighted graph is denoted by . The graph  consists of  vertices, which we rename to , so that  corresponds to the vertex , ... ,  corresponds to the vertex . In particular, this gives . The vertices  and  are the boundary vertices of , and we refer to them by . The interior vertices of  are given by .\n\nEach graph  is naturally associated with a probabilistic graph Laplacian, denoted  , and given by\n*\n\nNote that for , the probabilistic graph Laplacian  is independent of the parameter , and therefore we omit it from the notation in this case\n\nThe self-similar almost Mathieu operators\nWe introduce a self-similar version of almost Mathieu operators defined with respect to the self-similar Laplacian  introduced in the last section. Let , ,  and . We define\n\nSetting  recovers up to a multiplicative constant the common form of the one-dimensional almost Mathieu operators, i.e. for ,\n\nBy Lemma ,   is a bounded self-adjoint operator on .\n\nFor the sequence of graphs  given in Definition , we associate a truncation , of the almost Mathieu operators eq:AMOversionPQ, where we recall, . In particular,  is given by",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L293-330::c8",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L379-416::c10",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L379-416::c10",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 379,
    "end_line": 416,
    "text": "For the sequence of graphs  given in Definition , we associate a truncation , of the almost Mathieu operators eq:AMOversionPQ, where we recall, . In particular,  is given by\n\nNote that, similarly to the construction of the , we impose a reflecting boundary condition on the vertex . The restriction of  to the interior vertices of  is denoted by , i.e.\n\nWe identify  with  when defined on\nthe domain . We refer to  as the Dirichlet almost Mathieu operator of level .\nIn the following, we regard the matrix   as extended by zeros to a semi-infinite matrix.\n\nLet . Then\n\nThe strong convergence is evident and strong resolvent convergence follows by. The reader is also referred to. We note that the statement holds as well for  and .\n\nSpectral analysis of the self-similar almost Mathieu operators\nIn this section we prove  our two main results. First, we consider the truncated self-similar AMO , and prove that their spectra can be determined using the spectral decimation method when the parameter  is restricted to the set  where  is the truncation level. In particular, this finite graph case is given in Theorem . Subsequently, we state Theorem  under the same restriction on the parameter .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L332-374::c9",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L421-433::c11",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L421-433::c11",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 421,
    "end_line": 433,
    "text": "Spectral analysis of the self-similar almost Mathieu operators\nIn this section we prove  our two main results. First, we consider the truncated self-similar AMO , and prove that their spectra can be determined using the spectral decimation method when the parameter  is restricted to the set  where  is the truncation level. In particular, this finite graph case is given in Theorem . Subsequently, we state Theorem  under the same restriction on the parameter .\n\nFinite graphs caseThis section will briefly review a now standard technique  used in Analysis on Fractals and called Spectral Decimation. We prove that it can be applied to  the sequence of almost Mathieu operators  for , ,  and . The method was intensively applied in the context of  Laplacians on fractals and self-similar graphs. Its central idea is that the spectrum of such Laplacian can be completely described in terms of iterations of a rational function,  called the spectral decimation function. Below, we extend this method to the self-similar almost Mathieu operators when the frequency  is appropriately calibrated with the hierarchical structure of the self-similar Laplacian. In this case, we provide a complete description of the spectrum of th-level almost Mathieu operators  by relating it to the spectrum of th-level Laplacian, i.e. . The following theorem is the main result of this section.\n\nLet , , , and  be fixed. Let , and for  set . There exists a polynomial  of order  such that,\n\nFurthermore, for  and , the polynomial is given by\n\nBefore giving the proof of this result, we recall some facts that can be found in . Let  and  be Hilbert spaces, and  be an isometry. Suppose   and  are bounded linear operators on   and , respectively, and that  are complex-valued functions. Following, we say that the operator  spectrally similar to the operator  with functions  and  if",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L379-416::c10",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L435-456::c12",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L435-456::c12",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 435,
    "end_line": 456,
    "text": "Before giving the proof of this result, we recall some facts that can be found in . Let  and  be Hilbert spaces, and  be an isometry. Suppose   and  are bounded linear operators on   and , respectively, and that  are complex-valued functions. Following, we say that the operator  spectrally similar to the operator  with functions  and  if\n\nfor all  such that the two sides of eq:OriginalSpectSimi are well defined. In particular,  for  in the domain of both  and  such that , we have  (the resolvent of ) if and only if  (the resolvent of ).  We call  the spectral decimation function. In general, the functions  and  are usually difficult to express, but they can be computed effectively using the notion of  Schur complement. We refer to  for some examples. Identifying   with a closed subspace of  via , let  be the orthogonal complement and decompose  on    in the block form\n\n[, Lemma 3.3]\nFor  the operators  and  are spectrally similar if and only if\nthe Schur complement of , given by , satisfies\n\nis called the exceptional set of  and  plays a crucial role in the spectral decimation method.  The spectral decimation has been already implemented for . For the sake of completeness we state this result and refer to for more details.\n\nLet , then  is spectrally similar to  (with respect to functions given in). The spectral decimation function  and the exceptional set is  and\n\nMoreover,  and   for .\n\nFor the rest of this section, we fix  , , , and . We set ,  and . We apply Lemma  on the level  almost Mathieu operator . We obtain the block form () by decomposing  with respect to\n\nwhere  is the canonical basis defined in () and .\nIn practical terms:\n\nWe rearrange the vertices in such a way that all vertices  with  appear before all vertices with , i.e. .\nWe represent the matrix  with respect to the canonical basis so that the order of the basis vectors follows the order of the vertices in step one.\nThe matrix  is then decomposed into the following block form",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L421-433::c11",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L458-507::c13",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L458-507::c13",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 458,
    "end_line": 507,
    "text": "We rearrange the vertices in such a way that all vertices  with  appear before all vertices with , i.e. .\nWe represent the matrix  with respect to the canonical basis so that the order of the basis vectors follows the order of the vertices in step one.\nThe matrix  is then decomposed into the following block form\n\nwhere  and , correspond to the basis vectors  and , respectively.\nWe observe that  is a multiple of the identity matrix and that  is a block diagonal matrix in which the diagonal blocks are the th level Dirichlet almost Mathieu Operator , i.e.\n\nIn particular, we imply .\n\nLet , , , and  be fixed. Moreover, we set ,  , for . There exist functions   and , such that  is spectrally similar to  with respect to   and .\n\nDue to, it is sufficient to prove the existence of such functions   and , so that the th level  is spectrally similar  to\n\nwith the same functions  and .\nThe assumption   guarantees that the matrix  is symmetric with respect to its boundary vertices in the sense of . The spectral similarity of  and  follows then by .\n\nAs a domain of    and   we use the resolvent\nof , where  is the block diagonal matrix in eq: decompoMatrices.\nFor more details about this facts we refer to .\n\nLet , , , and  be fixed, and  set ,  , for . The following statements hold:\n\nfor all .\nThe exceptional set of  is given by .\nThe spectral decimation function  is a polynomial of order .\n\nif and only if .\n\nWe prove this result in a more general setting of mirror-symmetric Jacobi matrices in a companion paper.\n\nThe following could be derived immediately from Lemma , but for the sake of completeness and clarity we give the details leading to  explicit formulas for ,  and .\n\nLet  and . Then  is spectrally similar to   with the functions\n\nThe spectral decimation function  and the exceptional set  are given by\n\nWith the same argument as in the proof of Lemma , it is sufficient to consider the spectral similarity between  and . Applying the above three steps on the level-one almost Mathieu operator gives\n\nWe compute the Schur complement and express it as a linear combination ,",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L435-456::c12",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L512-562::c14",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L512-562::c14",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 512,
    "end_line": 562,
    "text": "We compute the Schur complement and express it as a linear combination ,\n\nThe formulas () and () can be verified by comparing both sides of the equation ().\n\n[Proof of Theorem ] We note that the spectra of  are nested, i.e. .  We split the preimages set into two subsets:\n\n: There are  distinct eigenvalues in . In particular,  and\n*\nNote that by Proposition (4), we conclude that all the  preimages are not in the exceptional set and therefore eigenvalues of  , see. Besides, this implies that all the  preimages are distinct eigenvalues.\n: By Proposition (4), we have\n*\nBy excluding the exceptional points, we see that  generates  distinct eigenvalues of  , namely the eigenvalues in .\nWe generated in part one and two  distinct eigenvalues, which shows with a dimension argument that we completely determined the spectrum .\n\nInfinite graphs case\n\nWe extend the statement of Theorem  to infinite graphs.  We provide a complete description of the spectrum of the almost Mathieu operators  by relating it to the  self-similar Laplacian's spectrum . The following theorem is the main result.\n\nLet   and  be given as in  () and (). Let ,  and  be fixed. We set ,  , for . There exists a polynomial  of order  such that,\n\nMoreover,  has purely singularly continuous spectrum if .\n\nThe first part of\ntheorem  is a   consequence of . We proceed as in the previous section and apply the spectral decimation method. We set   and , . Strictly speaking, the  self-similar Laplacian  in Theorem  is defined on . To understand this, we follow  and introduce  a dilation operator\n\nand its co-isometric adjoint",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L458-507::c13",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L564-585::c15",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L564-585::c15",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 564,
    "end_line": 585,
    "text": "and its co-isometric adjoint\n\nNext, we define the operator  on  to be . According to ,  on  is isometrically equivalent to  on  and . In the following, we will omit the tilde and refer to  by . We regard  as a subspace of   and introduce\nas the orthogonal complement of  in . Then  is decomposed with respect to  into the following block form\n\nWe observe that  is a multiple of the identity and that  is a block diagonal semi-finite matrix in which the diagonal blocks are the th level Dirichlet almost Mathieu Operator , i.e.\n\nSimilar to the proof of Lemma , the spectral similarity of  and  implies the spectral similarity of  and  with the same , ,  and . By, we see that  for ,\n*\nNext, we show .  To this end we use Proposition  (4), that is  and the fact that  and  are not isolated points in the spectrum . Let . By a continuity argument, we can find a sequence , ,  and a partial inverse of\n(which we will denote by  to avoid extra notation), such that\n.  Again with proposition (4) we have  for all  and imply by that\n\nBy closedness of the spectrum, we conclude that , see also Remark . The same argument holds for . The second part of the statement followes by combined with.\n\nIntegrated density of states\n\nThroughout this section, we assume that  and   are fixed. We follow ideas presented in and define the density of states of . We start by considering the spectrum of , which consists of finitely many simple eigenvalues. We refer to the normalized sum of Dirac measures concentrated on the eigenvalues",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L512-562::c14",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L587-591::c16",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L587-591::c16",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 587,
    "end_line": 591,
    "text": "Throughout this section, we assume that  and   are fixed. We follow ideas presented in and define the density of states of . We start by considering the spectrum of , which consists of finitely many simple eigenvalues. We refer to the normalized sum of Dirac measures concentrated on the eigenvalues\n\nas the density of states of . The normalized eigenvalue counting function of   is then given by .  We note that  is the restriction of  to the finite graph   while imposing Neumann boundary conditions.  As the following results can be derived in the same way when Dirichlet boundary conditions are applied, we restrict our consideration to the former one.  Figure   depicts the normalized eigenvalue counting function  for different  parameters.\n\nWe recall some known facts about the spectrum of the self-similar Laplacian . Theorem 1 and Proposition 10  in show that the spectrum  is the Julia set  of the polynomial  given in Proposition  , for more general settings see. For , we have  and the spectrum is absolutely continuous. For ,  the Julia set  is a Cantor set of Lebesgue measure zero and the spectrum is purely singularly continuous.\nBrolin in proved the existence of a natural measure on polynomial Julia sets, namely the so-called balanced invariant measure. Moreover, he showed that the balanced invariant measure coincides with the potential theory's equilibrium (harmonic) measure. In higher generality the uniqueness of the balanced invariant measure was established later  in,  the reader is referred to for an overview. Denoting the balanced invariant measure of the Julia set  by  and  and using  ideas similar to Brolin's lead to  the following result.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L564-585::c15",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L593-626::c17",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L593-626::c17",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 593,
    "end_line": 626,
    "text": "We recall some known facts about the spectrum of the self-similar Laplacian . Theorem 1 and Proposition 10  in show that the spectrum  is the Julia set  of the polynomial  given in Proposition  , for more general settings see. For , we have  and the spectrum is absolutely continuous. For ,  the Julia set  is a Cantor set of Lebesgue measure zero and the spectrum is purely singularly continuous.\nBrolin in proved the existence of a natural measure on polynomial Julia sets, namely the so-called balanced invariant measure. Moreover, he showed that the balanced invariant measure coincides with the potential theory's equilibrium (harmonic) measure. In higher generality the uniqueness of the balanced invariant measure was established later  in,  the reader is referred to for an overview. Denoting the balanced invariant measure of the Julia set  by  and  and using  ideas similar to Brolin's lead to  the following result.\n\nThe sequence of density of states  converges weakly to the balanced invariant measure  of the Julia set .\nLet  , ,   and  be fixed. In the same way as above, we define the density of states and the normalized eigenvalue counting function of  and refer to them by  and , respectively. Theorem  asserts the existence of a polynomial  of order . Let  be the  branches of the inverse   and  (-measurable). We define the following measure\n\nwhere  is the characteristic function of the set , i.e.\n\nLet  denotes the support of . Then .\nThe sequence of density of states  converges weakly to . Moreover, the following identity holds\n\nfor  , i.e.  is a  continuous bounded function on .\n\nLet . Theorem  implies\n\nWe show that the first term on the right-hand side of equation () converges to the term on the right-hand side of equation ().\n*\n\nThe existence and continuity of the branches of the inverse   on the interval  is given in a forthcoming work, where we develop a general framework by extending the results obtained in this paper to a large class of Jacobi operators.\nTheorem  and proposition  justify the following definitions.\n\nWe refer to  and  as the density of states of  and , respectively. The corresponding integrated density of states are given by  and .\n\nIt now follows that\n\nLet , then .\n\nWe compute\n\nwhere in the second equality, we use that  ( almost surely), whenever  and .\nThe intuitively,   Theorem  implies that the density of states  equally distributes the original mass  of the spectrum  on the  branches of the inverse spectral decimation function . In particular, this enables us to compute the spectral gap labels of . Let  be the resolvent set of . We define the set of spectral gap labels of  by\n\nIt is not difficult to see that . For , we have",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L587-591::c16",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L628-844::c18",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L628-844::c18",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 628,
    "end_line": 844,
    "text": "It is not difficult to see that . For , we have\n\nWe define the set of spectral gap labels of  similarly and denote it by .\n[Gap labeling]\nThe set of spectral gap labels of  is given by\n\nExamples and numerical resultsSpectra of   and\nWe apply the above framework for finite graphs in the case ,  and . Direct computations give . With Proposition  we compute the exceptional set and ,\n\nWe give an illustration of Theorem . Due to the spectral similarity between  and , we see that  if and only if . We compute the preimage sets  and , see Figure   and Table  [tab:table1]1. We note that  is a polynomial of degree 3; therefore, each of the eigenvalues  generates three preimages. Excluding the exceptional points results in four distinct eigenvalues of  ,  which on the other hand, determine the complete spectrum as  is a  matrix.\n\nTo compute , we first use Proposition   and  the spectral decimation function  to calculate . It can be easily checked that . In particular, four out of the ten eigenvalues in  are computed similarly to above, namely as the elements of preimage sets   and  with excluding the points in the exceptional set. The preimage sets  and  are computed as shown in Figure   with the numerical values in Table [tab: spectraForAlpha1over3first3levelsh2]2. These sets generate the remaining 6 eigenvalues. Note in level two, the graph   consists of  vertices.\n\nSpectral gaps\n\nThe disconnectedness of the Julia set , for , implies that the self-similar Laplacian  has infinitely many spectral gaps. This fact combined with Theorem  lead us to the following two conclusions:\nFor , the spectrum  has infinitely many spectral gaps.\nWe can generate the spectral gaps iteratively using the spectral decimation function .\nWe illustrate these ideas with the example , , ,  and generate the spectral gaps in  using",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L593-626::c17",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L848-873::c19",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L848-873::c19",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 848,
    "end_line": 873,
    "text": "The disconnectedness of the Julia set , for , implies that the self-similar Laplacian  has infinitely many spectral gaps. This fact combined with Theorem  lead us to the following two conclusions:\nFor , the spectrum  has infinitely many spectral gaps.\nWe can generate the spectral gaps iteratively using the spectral decimation function .\nWe illustrate these ideas with the example , , ,  and generate the spectral gaps in  using\n\nTo locate the first two spectral gaps of , we note that . By Theorem , we obtain\n*\nor equivalently\n*\nPlotting the spectral decimation function  with both cutoffs  and  in Figure , generates the first two spectral gaps  and . By Proposition , we know that  if and only if .\nThe eigenvalues of  are listed in Table  [tab:table1]1 and we denote the eigenvalues   by  and  . This gives\n\nThe spectrum of  is then contained in the complement (in ) of the following set\n*\nwhere  and .\n\nTo generate the next spectral gaps, we proceed similarly and note that\n\nwhere  and\n(with Dirichlet boundary conditions). Hence,\n*\nPlotting the spectral decimation function  with both cutoffs ,  and ,  in Figure , generates the next six spectral gaps.\n\nGap labeling\nFigures  and   give a numerical  illustration of eq:almostSelfSimiId). We recall that  the spectral decimation function  is a polynomial of degree . As such,  Figure  shows that on each range of the nine branches , we have a copy of Figure  (left) rescaled by , according to Corollary . This case corresponds to a periodic Jacobi matrix, and the spectrum consists of nine spectral bands. As expected from Corollary , the set of spectral gap labels is\n\nSimilarly, the spectral decimation function  is a polynomial of degree . As such, Figure  shows that on each range of the nine branches , we have a copy of Figure  (right) rescaled by . In particular, this highlight the Cantor set structure inherited from   and the set of spectral gap labels is deduced from Corollary .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L628-844::c18",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L963-966::c20",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L963-966::c20",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 963,
    "end_line": 966,
    "text": "Similarly, the spectral decimation function  is a polynomial of degree . As such, Figure  shows that on each range of the nine branches , we have a copy of Figure  (right) rescaled by . In particular, this highlight the Cantor set structure inherited from   and the set of spectral gap labels is deduced from Corollary .\n\nConnections approaches of    Bellissard and Bessis-Geronimo-Moussa\nOur work is partially motivated by Bellissard's studies on Hamiltonians describing the motion of a particle in quasicrystals. More specifically, his construction of  a large class of Hamiltonians with Cantor spectra starting from Jacobi matrices and their  associated Julia sets, see . To draw the parallel with our work we make the following observations. Given a polynomial  , let  be the corresponding (compact) Julia set, which, under some assumptions on  is a completely disconnected set. In addition, let    be the balanced invariant measure of  and consider the Hilbert space . The multiplication operator  associated with the identity function  in  is bounded, self adjoint, has the Cantor set   as spectrum. Furthermore,  is  the spectral measure of  leading to a singular spectrum. Because the linearly independent set  generates a dense linear subspace of  , the operator  can be represented  as a semi-infinite Jacobi matrix. Moreover,  satisfies a renormalization group equation\n\nwhere the partial isometry  and its adjoint  are given in .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L848-873::c19",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L968-974::c21",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L968-974::c21",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 968,
    "end_line": 974,
    "text": "where the partial isometry  and its adjoint  are given in .\n\nThe connection between our work and Bellissard's original ideas as elaborated above begins by using defining a probabilistic Laplacian (the so-called pq-model) on the integers half-line , regarded as a hierarchical or substitution graph with  in Figure  (right) as its basic building block.\nThe graph  determines the spectral decimation function  in eq:specDeciFuncLap, a polynomial which plays the role of the polynomial   appearing in Bellissard's approach. On the one hand,  each Laplacian  represents an example of a semi-infinite  Jacobi matrix that, in similarly to the operators in Bellissard's construction, has a spectrum that coincides with : the Julia set of the polynomial . On the other hand, the balance measure of  plays the role of the spectral measure in Bellissard's approach and is also the density of states in our context, see Proposition . In a forthcoming work, we generalize the substitution rule in Definition  leading to a multiple-parameter families of probabilistic Laplacians whose spectral properties are investigated with similar tools as the aforementioned  pq-model.\n\nWe note that the spectra of the self-similar almost Mathieu operators we introduced in this paper are not necessarily given as the Julia sets of some polynomials. Instead,  as proved in Theorem  these  spectra are preimages of Julia sets under certain polynomials. In, these results are extended to a class of Jacobi operators, for which we establish  a renormalization group equation, see. For example, when reduced to the pq-model, this renormalization group equation for resolvent, see, takes the form\n\nwhere  is given in eq:specDeciFuncLap, and  and  are defined in . For comparison with eq:RenoGroBelli, we compute",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L963-966::c20",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L976-992::c22",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L976-992::c22",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 976,
    "end_line": 992,
    "text": "where  is given in eq:specDeciFuncLap, and  and  are defined in . For comparison with eq:RenoGroBelli, we compute\n\nwhich coincides with the factor on the right-hand side of equation () if and only if .\nThus, our results is related to, although we do not rely on as we consider a model which allows us to produce more explicit computation of the spectrum for operators with potential.\n\nOur work is motivated by Bellissard's studies on Hamiltonians describing the motion of a particle in quasicrystals. In particular, his approach in , where Jacobi matrices are constructed to an associated given Julia set and in this way being able to generate a large class of Hamiltonians with Cantor spectra. The approach might be sketched as follows. Let  be a given polynomial and  the corresponding Julia set. The key observation is that the Julia set in the context of polynomials is always compact, and it is completely disconnected under certain assumptions on the polynomial . Let   be the balanced invariant measure of the Julia set  and introduce the Hilbert space . Define  as the operator of multiplication by the identity function  in  and as anticipated, this operator  is bounded  and self adjoint with the Cantor set  as its spectrum. The spectral measure of  is given by   and the spectrum is hence singular.\n\nUsing the fact that the monomial functions  are linearly independent and generate a dense linear subspace in , leads to a representation of the operator  as a Jacobi semi-infinite matrix. Moreover, the operator  satisfies a renormalization group equation\n\nwhere the reader is referred to for the definition of the partial isometry  and its adjoint .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L968-974::c21",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L994-998::c23",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L994-998::c23",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 994,
    "end_line": 998,
    "text": "where the reader is referred to for the definition of the partial isometry  and its adjoint .\n\nIn the following we want to point out some connections between our approach and Bellissard's original ideas. We utilize the pq-model as a starting point of our investigation. It serves as a well-understood and simple model of the integers half-line  regarded as a hierarchical or substitution graph with  in figure  (right) as its basic building block. The graph  determines the spectral decimation function  in (), which is a polynomial and plays the role of the  in Bellissard's approach. Each Laplacian  represents an example of a Jacobi semi-infinite matrix that, similarly to the operators in Bellissard's construction, has a spectrum that coincides with the Julia set of the polynomial , i.e. . On the other hand, while the balances measure of  plays the role of the spectral measure in Bellissard's approach, it is the density of states in our context (proposition ). We note that the substitution rule in definition  is generalized in, which enabled us to define multiple-parameter families of probabilistic Laplacians in. In this way, we provide further examples of operators whose spectral properties can be investigated with similar tools as the pq-model.\n\nIn this paper, we extend our approach to the self-similar almost Mathieu operators. This class of examples might not have spectra given by Julia sets of some polynomials; nevertheless, Theorem  shows that their spectra are characterized as preimages of Julia sets under certain polynomials. In, we  identify a class of Jacobi operators that extends the result in Theorem . We refer to this class of operators as piecewise centrosymmetric Jacobi operators.\nWe note that we were able to prove a renormalization group equation in our approach as well, see . For instance, we can compute explicitly for the pq-model",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L976-992::c22",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1000-1015::c24",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1000-1015::c24",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1000,
    "end_line": 1015,
    "text": "In this paper, we extend our approach to the self-similar almost Mathieu operators. This class of examples might not have spectra given by Julia sets of some polynomials; nevertheless, Theorem  shows that their spectra are characterized as preimages of Julia sets under certain polynomials. In, we  identify a class of Jacobi operators that extends the result in Theorem . We refer to this class of operators as piecewise centrosymmetric Jacobi operators.\nWe note that we were able to prove a renormalization group equation in our approach as well, see . For instance, we can compute explicitly for the pq-model\n\nwhere  is given in (). The reader is referred to for the exact definition of  and . For comparision with (), we compute\n)\nwhich coincides with the factor on the right-hand side of equation () when .\n\nConclusions)\n\nIn this paper we  introduce and study a fractal version of the almost Mathieu operators . We propose a new adaptation of the  method of spectral similarity to analyze their spectral properties. Our main conclusions are the following.\n\nTheorem  presents a useful algebraic tool to relate the spectrum of the almost Mathieu operators   to that of a family of self-similar Laplacians . Our results are established when the parameter  belongs to the dense set  where . Note that in the classical case, corresponding to  in our formulation, many important results   are also obtained  for  irrational, but in the fractal setting the methods for irrational  are not developed yet.\n\nThe method of spectral similarity is applicable in many situations, and in a forthcoming work we develop a general framework by working with  a large class of Jacobi operators. We call these operators piecewise centrosymmetric Jacobi operators .\nIn this general setting   the spectral decimation function can be computed using the theory of   orthogonal polynomials associated with the aforementioned Jacobi matrix. As a result, the spectral decimation function in the generalizations of Theorem  can be computed using a three-term recurrence relation, which provides a simple procedure to show that the spectral decimation function is a polynomial of a specific degree with properties that can be controlled.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L994-998::c23",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1017-1022::c25",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1017-1022::c25",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1017,
    "end_line": 1022,
    "text": "The method of spectral similarity is applicable in many situations, and in a forthcoming work we develop a general framework by working with  a large class of Jacobi operators. We call these operators piecewise centrosymmetric Jacobi operators .\nIn this general setting   the spectral decimation function can be computed using the theory of   orthogonal polynomials associated with the aforementioned Jacobi matrix. As a result, the spectral decimation function in the generalizations of Theorem  can be computed using a three-term recurrence relation, which provides a simple procedure to show that the spectral decimation function is a polynomial of a specific degree with properties that can be controlled.\n\nOur methods allow to compute explicitly the density of states. In particular, we proved in theorem  an explicit formula connecting   the density of states of   by identifying it with the weighted preimages of the balanced invariant measure on the Julia set of the polynomial  . This approach can be generalized to many other situations, and can be verified numerically, see  Section .\n\nIn our particular situation  we are able to conclude  that the operators   have  singularly  continuous spectrum when  because of the previous recent work  that the spectrum is singularly continuous for  . This result requires a detailed analysis of a certain dynamical system describing the behavior of the generalized eigenfunction.\n\nA particular novelty of our results is that we develop the spectral analysis of a self-similar Laplacian with a quasi-periodic potential. In our work we have made the essential steps towards the Fourier analysis on one-dimensional self-similar structures   following the general approach developed by Strichartz et al .  In certain particular situations this allows to consider classical and quantum wave prorogation on fractal and other irregular structures.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1000-1015::c24",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1025-1035::c26",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1025-1035::c26",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1025,
    "end_line": 1035,
    "text": "A particular novelty of our results is that we develop the spectral analysis of a self-similar Laplacian with a quasi-periodic potential. In our work we have made the essential steps towards the Fourier analysis on one-dimensional self-similar structures   following the general approach developed by Strichartz et al .  In certain particular situations this allows to consider classical and quantum wave prorogation on fractal and other irregular structures.\n\nUsing these Harmonic Analysis tools, our work introduces a direct approach to the  gap labeling for a self-similar Laplacian with a potential. In particular, this   direct approach   for gap labeling is complementing. In our case we do not make use of the   dual of a group acting on the fractal lattice, and observe that gap labels of the form  are consistent  with the self-similar quasi-periodic structure where renormalization acts by the dilation of the space  by . This should be contrasted with the gap labeling for fractal structures with more complicated topological structure currently under investigation in, including the classical Sierpinski gasket and a new model of the bubble diamond fractals. In general, on a certain class of self-similar structures the gaps  are labeled by the values of the\nintegrated density of states of the Laplacian with values  where  is the topological degree of the self-covering map of the fractal limit space.\nThus, our work  sets the stage for considering the Bloch theorem, noncommutative Chern characters and fractal-based quantum Hall systems, see  , as well as. On fractal spaces this is an open problem that has not been previously considered in the literature besides the recent work.\n\nOur work is connected to several lines of investigations in mathematics and physics, including the topics highlighted at the recent workshop\nhttps://alexander-teplyaev.uconn.edu/quasi-periodic-spectral-and-topological-analysis/Quasi-periodic spectral and topological analysis,\nand in particular the work of\nE. Akkermans,\nD. Damanik  ,\nS. Jitomirskaya, and\nE. Prodan et al.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1017-1022::c25",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1048-1111::c27",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1048-1111::c27",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1048,
    "end_line": 1111,
    "text": "Our work is connected to several lines of investigations in mathematics and physics, including the topics highlighted at the recent workshop\nhttps://alexander-teplyaev.uconn.edu/quasi-periodic-spectral-and-topological-analysis/Quasi-periodic spectral and topological analysis,\nand in particular the work of\nE. Akkermans,\nD. Damanik  ,\nS. Jitomirskaya, and\nE. Prodan et al.\n\nAcknowledgments The work of G.  Mograby was supported by ARO grant W911NF1910366.  K. A. Okoudjou was partially supported by ARO grant W911NF1910366 and the National Science Foundation under Grant No. DMS-1814253. A. Teplyaev was partially supported by NSF DMS grant 1613025 and by the Simons Foundation.\n\nplain\n\nE. Akkermans.\nStatistical mechanics and quantum fields on fractals.\nIn Fractal geometry and dynamical systems in pure and applied\nmathematics. II. Fractals in applied mathematics, volume 601 of   Contemp. Math., pages 1-21. Amer. Math. Soc., Providence, RI, 2013.\n\nE. Akkermans, Y. Don, J. Rosenberg, and C. Schochet.\nRelating diffraction and spectral data of aperiodic tilings: towards\na Bloch theorem.\nJ. Geom. Phys., 165:104217, 23, 2021.\n\nE. Akkermans, G. Dunne, and E. Levy.\nWave propagation in one-dimension: Methods and applications to\ncomplex and fractal structures.\nIn Optics of Aperiodic Structures: Fundamentals and Device\nApplications, pages 407-449. Pan Stanford Publishing, 2014.\n\nE. Akkermans and G. Montambaux.\nMesoscopic physics of electrons and photons.\nCambridge university press, 2007.\n\nS. Alexander.\nSome properties of the spectrum of the Sierpinski gasket in a\nmagnetic field.\nPhys. Rev. B (3), 29(10):5504-5508, 1984.\n\nU. Andrews, G. Bonik, J. Chen, R. Martin, and A. Teplyaev.\nWave equation on one-dimensional fractals with spectral decimation\nand the complex dynamics of polynomials.\nJ. Fourier Anal. Appl., 23(5):994-1027, 2017.\n\nA. Avila and S. Jitomirskaya.\nThe ten Martini problem.\nAnn. of Math. (2), 170(1):303-342, 2009.\n\nN. Avni, J. Breuer, and B. Simon.\nPeriodic Jacobi matrices on trees.\nAdv. Math., 370:107241, 42, 2020.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1025-1035::c26",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1113-1162::c28",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1113-1162::c28",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1113,
    "end_line": 1162,
    "text": "N. Avni, J. Breuer, and B. Simon.\nPeriodic Jacobi matrices on trees.\nAdv. Math., 370:107241, 42, 2020.\n\nN. Bajorin, T. Chen, A. Dagan, C. Emmons, M. Hussein, M. Khalil, P. Mody,\nB. Steinhurst, and A. Teplyaev.\nVibration modes of -gaskets and other fractals.\nJ. Phys. A, 41(1):015101, 21, 2008.\n\nN. Bajorin, T. Chen, A. Dagan, C. Emmons, M. Hussein, M. Khalil, P. Mody,\nB. Steinhurst, and A. Teplyaev.\nVibration spectra of finitely ramified, symmetric fractals.\nFractals, 16(3):243-258, 2008.\n\nR. Balu, G. Mograby, K. Okoudjou, and A. Teplyaev.\nSpectral decimation of piecewise centrosymmetric Jacobi operators\non graphs.\n(in preparation).\n\nM. Barnsley, J. Geronimo, and A. Harrington.\nInfinite-dimensional Jacobi matrices associated with Julia sets.\nProc. Amer. Math. Soc., 88(4):625-630, 1983.\n\nM. Barnsley, J. Geronimo, and A. Harrington.\nAlmost periodic Jacobi matrices associated with Julia sets for\npolynomials.\nComm. Math. Phys., 99(3):303-317, 1985.\n\nS. Becker, R. Han, and S. Jitomirskaya.\nCantor spectrum of graphene in magnetic fields.\nInvent. Math., 218(3):979-1041, 2019.\n\nJ. Bellissard.\nGap labelling theorems for Schrodinger operators.\nIn From number theory to physics (Les Houches, 1989), pages\n538-630. Springer, Berlin, 1992.\n\nJ. Bellissard.\nRenormalization group analysis and quasicrystals.\nIn Ideas and methods in quantum and statistical physics (Oslo,\n1988), pages 118-148. Cambridge Univ. Press, Cambridge, 1992.\n\nJ. Bellissard, R. Benedetti, and J. Gambaudo.\nSpaces of tilings, finite telescopic approximations and gap-labeling.\nComm. Math. Phys., 261(1):1-41, 2006.\n\nJ. Bellissard, A. Bovier, and J. Ghez.\nGap labelling theorems for one-dimensional discrete Schrodinger\noperators.\nRev. Math. Phys., 4(1):1-37, 1992.\n\nJ. Bellissard and B. Simon.\nCantor spectrum for the almost Mathieu equation.\nJ. Functional Analysis, 48(3):408-419, 1982.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1048-1111::c27",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1164-1214::c29",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1164-1214::c29",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1164,
    "end_line": 1214,
    "text": "J. Bellissard and B. Simon.\nCantor spectrum for the almost Mathieu equation.\nJ. Functional Analysis, 48(3):408-419, 1982.\n\nJean Bellissard.\nStability and instability in quantum mechanics.\nIn Trends and developments in the eighties (Bielefeld,\n1982/1983), pages 1-106. World Sci. Publishing, Singapore, 1985.\n\nM. Benameur and V. Mathai.\nProof of the magnetic gap-labelling conjecture for principal\nsolenoidal tori.\nJ. Funct. Anal., 278(3):108323, 9, 2020.\n\nD. Bessis, J. S. Geronimo, and P. Moussa.\nFunction weighted measures and orthogonal polynomials on Julia\nsets.\nConstr. Approx., 4(2):157-173, 1988.\n\nE. Bird, S. Ngai, and A. Teplyaev.\nFractal Laplacians on the unit interval.\nAnn. Sci. Math. Quebec, 27(2):135-168, 2003.\n\nH. Brolin.\nInvariant sets under iteration of rational functions.\nArk. Mat., 6:103-144 (1965), 1965.\n\nA. Cantoni and P. Butler.\nEigenvalues and eigenvectors of symmetric centrosymmetric matrices.\nLinear Algebra Appl., 13(3):275-288, 1976.\n\nJ. Chan, S. Ngai, and A. Teplyaev.\nOne-dimensional wave equations defined by fractal Laplacians.\nJ. Anal. Math., 127:219-246, 2015.\n\nJ. Chen and A. Teplyaev.\nSingularly continuous spectrum of a self-similar Laplacian on the\nhalf-line.\nJ. Math. Phys., 57(5):052104, 10, 2016.\n\nD. Damanik, M. Embree, and A. Gorodetski.\nSpectral properties of Schrodinger operators arising in the\nstudy of quasicrystals.\nIn Mathematics of aperiodic order, volume 309 of Progr.\nMath., pages 307-370. Birkhauser/Springer, Basel, 2015.\n\nD. Damanik, J. Fillman, and A. Gorodetski.\nMultidimensional almost-periodic Schrodinger operators with\nCantor spectrum.\nAnn. Henri Poincare, 20(4):1393-1402, 2019.\n\nD. Damanik, J. Fillman, and A. Gorodetski.\nMultidimensional Schrodinger operators whose spectrum features\na half-line and a Cantor set.\nJ. Funct. Anal., 280(7):Paper No. 108911, 38, 2021.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1113-1162::c28",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1216-1269::c30",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1216-1269::c30",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1216,
    "end_line": 1269,
    "text": "D. Damanik, J. Fillman, and A. Gorodetski.\nMultidimensional Schrodinger operators whose spectrum features\na half-line and a Cantor set.\nJ. Funct. Anal., 280(7):Paper No. 108911, 38, 2021.\n\nD. Damanik and D. Lenz.\nUniform spectral properties of one-dimensional quasicrystals. I.\nAbsence of eigenvalues.\nComm. Math. Phys., 207(3):687-696, 1999.\n\nD. Damanik and D. Lenz.\nHalf-line eigenfunction estimates and purely singular continuous\nspectrum of zero Lebesgue measure.\nForum Math., 16(1):109-128, 2004.\n\nG. Derfel, P. Grabner, and F. Vogl.\nLaplace operators on fractals and related functional equations.\nJ. Phys. A, 45(46):463001, 34, 2012.\n\nE. Dinaburg and J. Sinai.\nThe one-dimensional Schrodinger equation with quasiperiodic\npotential.\nFunkcional. Anal. i Prilozen., 9(4):8-21, 1975.\n\nE. Domany, S. Alexander, D. Bensimon, and L. Kadanoff.\nSolutions to the Schrodinger equation on some fractal lattices.\nPhys. Rev. B (3), 28(6):3110-3123, 1983.\n\nS. Fang, D. King, E. Lee, and R. Strichartz.\nSpectral decimation for families of self-similar symmetric\nLaplacians on the Sierpinski gasket.\nJ. Fractal Geom., 7(1):1-62, 2020.\n\nP. Fatou.\nSur les equations fonctionnelles.\nBull. Soc. Math. France, 47:161-271, 1919.\n\nA. Freire, A. Lopes, and R. Mane.\nAn invariant measure for rational maps.\nBol. Soc. Brasil. Mat., 14(1):45-62, 1983.\n\nM. Fukushima and T. Shima.\nOn a spectral analysis for the Sierpinski gasket.\nPotential Anal., 1(1):1-35, 1992.\n\nK. Hare, B. Steinhurst, A. Teplyaev, and D. Zhou.\nDisconnected Julia sets and gaps in the spectrum of Laplacians on\nsymmetric finitely ramified fractals.\nMath. Res. Lett., 19(3):537-553, 2012.\n\nP. Harper.\nSingle band motion of conduction electrons in a uniform magnetic\nfield.\nProc. Phys. Soc. Section A, 68(10):874-878, 1955.\n\nD. Hofstadter.\nEnergy levels and wave functions of bloch electrons in rational and\nirrational magnetic fields.\nPhys. Rev. B, 14:2239-2249, Sep 1976.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1164-1214::c29",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1271-1324::c31",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1271-1324::c31",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1271,
    "end_line": 1324,
    "text": "D. Hofstadter.\nEnergy levels and wave functions of bloch electrons in rational and\nirrational magnetic fields.\nPhys. Rev. B, 14:2239-2249, Sep 1976.\n\nM. Ionescu, E. P. J. Pearse, L. G. Rogers, H.-J. Ruan, and R. S. Strichartz.\nThe resolvent kernel for PCF self-similar fractals.\nTrans. Amer. Math. Soc., 362(8):4451-4479, 2010.\n\nS. Jitomirskaya.\nMetal-insulator transition for the almost Mathieu operator.\nAnn. of Math. (2), 150(3):1159-1175, 1999.\n\nS. Jitomirskaya.\nOn point spectrum of critical almost mathieu operators.\npreprint\nhttps://www.math.uci.edu/ mathphysics/preprints/point.pdf, 2021.\n\nS. Jitomirskaya, H. Kruger, and W. Liu.\nExact dynamical decay rate for the almost Mathieu operator.\nMath. Res. Lett., 27(3):789-808, 2020.\n\nG. Julia.\nMemoire sur literation des applications fonctionnelles.\nJ. Math. Pures et Appl., 8:47-245, 1919.\n\nJ. Kigami.\nAnalysis on fractals, volume 143 of Cambridge Tracts in\nMathematics.\nCambridge University Press, Cambridge, 2001.\n\nW. Kirsch.\nAn invitation to random Schrodinger operators.\nIn Random Schrodinger operators, volume 25 of Panor.\nSyntheses, pages 1-119. Soc. Math. France, Paris, 2008.\nWith an appendix by Frederic Klopp.\n\nB. Kron and E. Teufl.\nAsymptotics of the transition probabilities of the simple random walk\non self-similar graphs.\nTrans. Amer. Math. Soc., 356(1):393-414, 2004.\n\nR. Mane.\nOn the uniqueness of the maximizing measure for rational maps.\nBol. Soc. Brasil. Mat., 14(1):27-43, 1983.\n\nL. Malozemov and A. Teplyaev.\nPure point spectrum of the Laplacians on fractal graphs.\nJ. Funct. Anal., 129(2):390-405, 1995.\n\nL. Malozemov and A. Teplyaev.\nSelf-similarity, operators and dynamics.\nMath. Phys. Anal. Geom., 6(3):201-218, 2003.\n\nM. Marcolli and V. Mathai.\nTowards the fractional quantum Hall effect: a noncommutative\ngeometry perspective.\nIn Noncommutative geometry and number theory, Aspects Math.,\nE37, pages 235-261. Friedr. Vieweg, Wiesbaden, 2006.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1216-1269::c30",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1326-1379::c32",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1326-1379::c32",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1326,
    "end_line": 1379,
    "text": "M. Marcolli and V. Mathai.\nTowards the fractional quantum Hall effect: a noncommutative\ngeometry perspective.\nIn Noncommutative geometry and number theory, Aspects Math.,\nE37, pages 235-261. Friedr. Vieweg, Wiesbaden, 2006.\n\nC. Marx and S. Jitomirskaya.\nDynamics and spectral theory of quasi-periodic Schrodinger-type\noperators.\nErgodic Theory Dynam. Systems, 37(8):2353-2393, 2017.\n\nE. Melville, G. Mograby, N. Nagabandi, L. Rogers, and A. Teplyaev.\nGaps labeling theorem for the Bubble-Diamond self-similar graphs.\n(in preparation).\n\nJ. Moser.\nAn example of a Schrodinger equation with almost periodic\npotential and nowhere dense spectrum.\nComment. Math. Helv., 56(2):198-224, 1981.\n\nX. Ni, K. Chen, M. Weiner, D. J Apigo, C. Prodan, A. Alu, E. Prodan, and A. B\nKhanikaev.\nObservation of hofstadter butterfly and topological edge states in\nreconfigurable quasi-periodic acoustic crystals.\nCommunications Physics, 2(1):1-7, 2019.\n\nO. Ovdat and E. Akkermans.\nBreaking of continuous scale invariance to discrete scale invariance:\nA universal quantum phase transition.\nIn Fractal Geometry and Stochastics VI, pages 209-238.\nSpringer, 2021.\n\nE. Prodan and H. Schulz-Baldes.\nBulk and boundary invariants for complex topological\ninsulators.\nMathematical Physics Studies. Springer, [Cham], 2016.\nFrom -theory to physics.\n\nE. Prodan and H. Schulz-Baldes.\nGeneralized Connes-Chern characters in -theory with an\napplication to weak invariants of topological insulators.\nRev. Math. Phys., 28(10):1650024, 76, 2016.\n\nE. Prodan and H. Schulz-Baldes.\nNon-commutative odd Chern numbers and topological phases of\ndisordered chiral systems.\nJ. Funct. Anal., 271(5):1150-1176, 2016.\n\nR. Rammal.\nSpectrum of harmonic excitations on fractals.\nJ. Physique, 45(2):191-206, 1984.\n\nR. Rammal and G. Toulouse.\nRandom walks on fractal structures and percolation clusters.\nJ. Phys. Lett., 44(1):13-22, 1983.\n\nM. Reed and B. Simon.\nMethods of modern mathematical physics. I. Functional\nanalysis.\nAcademic Press, New York-London, 1972.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1271-1324::c31",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1381-1436::c33",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1381-1436::c33",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1381,
    "end_line": 1436,
    "text": "M. Reed and B. Simon.\nMethods of modern mathematical physics. I. Functional\nanalysis.\nAcademic Press, New York-London, 1972.\n\nL. G. Rogers.\nEstimates for the resolvent kernel of the Laplacian on p.c.f.\nself-similar fractals and blowups.\nTrans. Amer. Math. Soc., 364(3):1633-1685, 2012.\n\nM. Rosa, M. Ruzzene, and E. Prodan.\nTopological gaps by twisting.\nCommunications Physics, 4(1):1-10, 2021.\n\nT. Shima.\nOn eigenvalue problems for the random walks on the Sierpinski\npre-gaskets.\nJapan J. Indust. Appl. Math., 8(1):127-141, 1991.\n\nT. Shima.\nThe eigenvalue problem for the Laplacian on the Sierpinski\ngasket.\nIn Asymptotic problems in probability theory: stochastic models\nand diffusions on fractals (Sanda/Kyoto, 1990), volume 283 of   Pitman Res. Notes Math. Ser., pages 279-288. Longman Sci. Tech., Harlow,\n1993.\n\nT. Shirai.\nThe spectrum of infinite regular line graphs.\nTrans. Amer. Math. Soc., 352(1):115-132, 2000.\n\nO. Shpielberg, Y. Don, and E. Akkermans.\nNumerical study of continuous and discontinuous dynamical phase\ntransitions for boundary-driven systems.\nPhys. Rev. E, 95(3):032137, 8, 2017.\n\nS. Smirnov.\nSpectral analysis of Julia sets.\nProQuest LLC, Ann Arbor, MI, 1996.\nThesis (Ph.D.)-California Institute of Technology.\n\nR. Strichartz.\nHarmonic analysis as spectral theory of Laplacians.\nJ. Funct. Anal., 87(1):51-148, 1989.\n\nR. Strichartz.\nThe Laplacian on the Sierpinski gasket via the method of\naverages.\nPacific J. Math., 201(1):241-256, 2001.\n\nR. Strichartz.\nFractafolds based on the Sierpinski gasket and their spectra.\nTrans. Amer. Math. Soc., 355(10):4019-4043, 2003.\n\nR. Strichartz.\nDifferential equations on fractals.\nPrinceton University Press, Princeton, NJ, 2006.\nA tutorial.\n\nR. Strichartz.\nTransformation of spectra of graph Laplacians.\nRocky Mountain J. Math., 40(6):2037-2062, 2010.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1326-1379::c32",
        "direction": "previous"
      },
      {
        "id": "2105.09896v3::L1438-1472::c34",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2105.09896v3::L1438-1472::c34",
    "file": "data/data/full_text/2105.09896v3.txt",
    "section_path": "",
    "start_line": 1438,
    "end_line": 1472,
    "text": "R. Strichartz.\nTransformation of spectra of graph Laplacians.\nRocky Mountain J. Math., 40(6):2037-2062, 2010.\n\nR. Strichartz and A. Teplyaev.\nSpectral analysis on infinite Sierpinski fractafolds.\nJ. Anal. Math., 116:255-297, 2012.\n\nA. Teplyaev.\nSpectral analysis on infinite Sierpinski gaskets.\nJ. Funct. Anal., 159(2):537-567, 1998.\n\nA. Teplyaev.\nSpectral zeta functions of fractals and the complex dynamics of\npolynomials.\nTrans. Amer. Math. Soc., 359(9):4339-4358, 2007.\n\nP. van Mouche.\nThe coexistence problem for the discrete Mathieu operator.\nComm. Math. Phys., 122(1):23-33, 1989.\n\nR. Vein and P. Dale.\nDeterminants and their applications in mathematical physics,\nvolume 134 of Applied Mathematical Sciences.\nSpringer-Verlag, New York, 1999.\n\nJ. Weaver.\nCentrosymmetric (cross-symmetric) matrices, their basic properties,\neigenvalues, and eigenvectors.\nAmer. Math. Monthly, 92(10):711-717, 1985.\n\nJ. Weidmann.\nStrong operator convergence and spectral theory of ordinary\ndifferential operators.\nUniv. Iagel. Acta Math., (34):153-163, 1997.\n\nA. Wilkinson.\nWhat are Lyapunov exponents, and why are they interesting?\nBull. Amer. Math. Soc. (N.S.), 54(1):79-105, 2017.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2105.09896v3::L1381-1436::c33",
        "direction": "previous"
      }
    ]
  }
]