[
  {
    "id": "2112.03216v2::L5-93::c0",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 5,
    "end_line": 93,
    "text": "positioning,patterns,shapes,arrows,calc\n\nUmathx45\nUmathxmn\n<5> <6> <7> <8> <9> <10>\n<10.95> <12> <14.4> <17.28> <20.74> <24.88>\nmathx10\n\nmathxUmathxmn\nUmathxmn\n0mathx\"71\n0mathx\"75\n\ntheoremTheorem[section]\nlemma[theorem]Lemma\n\nprop[theorem]Proposition\ncoro[theorem]Corollary\nconj[theorem]Conjecture\nclaimClaim[theorem]\n\ndefinition\nremark[theorem]Remark\ndefinition[theorem]Definition\n\nsubsection2\n.5.7.5\n\nequationsection\n\n[Unitary Almost Mathieu Operator]Almost Everything About the\nUnitary Almost Mathieu Operator\n\n[C. Cedzich]Christopher Cedzich\nmailto:cedzich@hhu.decedzich@hhu.de\nQuantum Technology Group, Heinrich Heine Universitat Dusseldorf, Universitatsstr. 1, 40225 Dusseldorf, Germany\n\n[J. Fillman]Jake Fillman\nmailto:fillman@txstate.edufillman@txstate.edu\nDepartment of Mathematics, Texas State University, San Marcos, TX 78666, USA\n\n[D. C. Ong]Darren C. Ong\nmailto:darrenong@xmu.edu.mydarrenong@xmu.edu.my\nDepartment of Mathematics and Applied Mathematics, Xiamen University Malaysia, Jalan Sunsuria, Bandar Sunsuria, 43900 Selangor, Malaysia and School of Mathematical Sciences, Xiamen University, 361005 Xiamen, Fujian, China",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L97-99::c1",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L97-99::c1",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 97,
    "end_line": 99,
    "text": "[D. C. Ong]Darren C. Ong\nmailto:darrenong@xmu.edu.mydarrenong@xmu.edu.my\nDepartment of Mathematics and Applied Mathematics, Xiamen University Malaysia, Jalan Sunsuria, Bandar Sunsuria, 43900 Selangor, Malaysia and School of Mathematical Sciences, Xiamen University, 361005 Xiamen, Fujian, China\n\nWe introduce the unitary almost-Mathieu operator, which is obtained from a two-dimensional quantum walk in a uniform magnetic field. We exhibit a version of Aubry-Andre duality for this model, which partitions the parameter space into three regions: a supercritical region and a subcritical region that are dual to one another, and a critical regime that is self-dual. In each parameter region, we characterize the cocycle dynamics of the transfer matrix cocycle generated by the associated generalized eigenvalue equation. In particular, we show that supercritical, critical, and subcritical behavior all occur in this model. Using Avila's global theory of one-frequency cocycles, we exactly compute the Lyapunov exponent on the spectrum in terms of the given parameters. We also characterize the spectral type for each value of the coupling constant, almost every frequency, and almost every phase. Namely, we show that for almost every frequency and every phase the spectral type is purely absolutely continuous in the subcritical region, pure point in the supercritical region, and purely singular continuous in the critical region. In some parameter regions, we refine the almost-sure results. In the critical case for instance, we show that the spectrum is a Cantor set of zero Lebesgue measure for arbitrary irrational frequency and that the spectrum is purely singular continuous for all but countably many phases.\n\nKeywords: Quantum Walks, Almost Mathieu Operator, Spectral Theory, Unitary Dynamics, CMV matrices, OPUC, Aubry duality.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L5-93::c0",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L112-115::c2",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L112-115::c2",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 112,
    "end_line": 115,
    "text": "Keywords: Quantum Walks, Almost Mathieu Operator, Spectral Theory, Unitary Dynamics, CMV matrices, OPUC, Aubry duality.\n\nIntroduction\nDiscrete-time quantum walks have been extensively studied over the years from different points of view. They have intrinsic mathematical interest and are important in physics, where they serve as models for the quantum evolution of single particles with internal degrees of freedom and bounded hopping length on a lattice or graph. In this context, quantum walks were shown to exhibit many single and few particle effects, such as ballistic motion, decoherence, dynamical localization, and the formation of bound states. Recently, quantum walks were shown to provide a testbed for symmetry protected topological order and bulk-boundary correspondence with a complete set of indices that are stable under compact as well as norm-continuous perturbations. Complementary to this, quantum walks can be viewed as quantum mechanical analogues of classical random walks. Their increased ballistic spreading compared to classical diffusion makes them interesting for applications in quantum computing such as the element distinctiveness problem, universal quantum computation, and search algorithms.\n\nFrom a mathematical point of view, a quantum walk is given by a unitary operator  acting in a suitable Hilbert space with an underlying lattice or graph structure. As such, the long-time dynamical characteristics of the system are given by powers  with , and one is naturally led to the study of the spectral problem of the unitary operator . See and references therein for a partial list of works that have analyzed quantum walks from the spectral perspective.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L97-99::c1",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L117-120::c3",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L117-120::c3",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 117,
    "end_line": 120,
    "text": "From a mathematical point of view, a quantum walk is given by a unitary operator  acting in a suitable Hilbert space with an underlying lattice or graph structure. As such, the long-time dynamical characteristics of the system are given by powers  with , and one is naturally led to the study of the spectral problem of the unitary operator . See and references therein for a partial list of works that have analyzed quantum walks from the spectral perspective.\n\nThe present paper aims to study the spectral properties of quantum walks in a homogeneous external magnetic field. We are motivated by work on electrons moving in a two-dimensional lattice under the influence of a uniform magnetic field, a physical system that has been intensively studied in recent decades; compare, e.g.,. The almost-Mathieu operator (and more generally the extended Harper's model) is one example of a model of an electron in a magnetic field, which inspired intense study in mathematics; see\nand references therein for a partial list. Despite the ostensible simplicity of the setup, the properties of this system are rich and deep, requiring extensive analysis to understand fully.\n\nMotivated by this, we discuss in this paper two-dimensional quantum walks in homogeneous magnetic fields, which are constructed via a discrete analogue of minimal coupling. After a suitable choice of gauge, this leads us to the investigation of one-dimensional quantum walks with quasiperiodic coin distribution. Using intuition from the two-dimensional setting, we introduce a pair of coupling constants  for the one-dimensional walk in a novel manner (cf. eq:moddefs:slambdaDef and eq:moddefs:coinDef). We then show that this partitions the parameter space into three regions. When , the behavior of the shift dominates and the resultant operator has absolutely continuous spectrum. When , the coin operator dominates, and one observes localization for typical frequencies. When , one observes singular continuous spectrum for all but an explicit countable set of phases. We describe the main accomplishments broadly here and more precisely in Section .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L112-115::c2",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L122-126::c4",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L122-126::c4",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 122,
    "end_line": 126,
    "text": "Motivated by this, we discuss in this paper two-dimensional quantum walks in homogeneous magnetic fields, which are constructed via a discrete analogue of minimal coupling. After a suitable choice of gauge, this leads us to the investigation of one-dimensional quantum walks with quasiperiodic coin distribution. Using intuition from the two-dimensional setting, we introduce a pair of coupling constants  for the one-dimensional walk in a novel manner (cf. eq:moddefs:slambdaDef and eq:moddefs:coinDef). We then show that this partitions the parameter space into three regions. When , the behavior of the shift dominates and the resultant operator has absolutely continuous spectrum. When , the coin operator dominates, and one observes localization for typical frequencies. When , one observes singular continuous spectrum for all but an explicit countable set of phases. We describe the main accomplishments broadly here and more precisely in Section .\n\nFirst, we give a complete account of the spectrum and the spectral type in a measure-theoretical sense (that is for a.e. frequency and a.e. phase), hence the title, which is naturally inspired by the titles of.\n\nNext, we answer a question posed by and to the authors of: how can one suitably incorporate a version of a \"coupling constant\" into the model of in such a manner that one sees a phase transition? Their model is given as a one-dimensional quantum walk, and each such walk is known to be equivalent to a CMV matrix which in turn is specified by a sequence  of Verblunsky coefficients in . In the CMV setting, it seems natural to introduce a coupling constant by multiplying the Verblunsky coefficients by a scalar ; however, this does not lead to fruitful results in the present setting. See also the discussion in, especially item 14 in Section B.1. Indeed, Simon says therein that the lack of suitable coupling constants \"impacted my ability to discuss almost periodic Verblunsky coefficients\", which suggests that our novel method of incorporating a coupling constant will have applications in other models.\n\nLet us also point out: as a result of this connection, every result in our paper can be translated into a result about a suitable CMV matrix. For the reader who is unfamiliar with OPUC and CMV matrices, we have included a detailed description of the connection between CMV matrices and one-dimensional quantum walks. We have chosen to formulate our work in terms of quantum walks, since that makes the origin of the model more transparent.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L117-120::c3",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L129-133::c5",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L129-133::c5",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 129,
    "end_line": 133,
    "text": "Let us also point out: as a result of this connection, every result in our paper can be translated into a result about a suitable CMV matrix. For the reader who is unfamiliar with OPUC and CMV matrices, we have included a detailed description of the connection between CMV matrices and one-dimensional quantum walks. We have chosen to formulate our work in terms of quantum walks, since that makes the origin of the model more transparent.\n\nThe first main ingredient in the proofs of our results is the classification of cocycle dynamics: in the nomenclature of Avila, we classify the matrix cocycle induced by the stationary equation of the walk (cf. eq:AlambdaCocycleDef) and show that it is subcritical on the spectrum when , supercritical on the spectrum when , and critical on the spectrum when . This discussion sweeps a few technicalities under the rug; the transfer matrix cocycle is not always well-defined for some values of the parameters and hence one works with a suitable regularization whose dynamics one can then characterize in the global theory scheme.\n\nThe second key ingredient is a suitable version of duality via a Fourier-type transform (cf. Theorems  and ); in analogy with the setting of Harper's model, we call this \"Aubry duality\". Up to a transpose, the duality transformation exchanges the coupling constants  and , which enables one to translate suitable reducibility or localization statements from one parameter region to another. In particular, the operators described herein are quasiperiodic unitary operators that obey a version of Aubry duality, and thus this work addresses a query from Li-Damanik-Zhou .  The form of duality enables one to show that all three spectral types (absolutely continuous, singular continuous, and pure point) occur within the non self-dual regimes.\n\nAs a byproduct of our model and the detailed cocycle analysis, we produce a family of quasiperiodic unitaries with positive Lyapunov exponents in certain parameter regions. As noted by Zhang, this is often difficult to accomplish. See also.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L122-126::c4",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L137-144::c6",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L137-144::c6",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 137,
    "end_line": 144,
    "text": "As a byproduct of our model and the detailed cocycle analysis, we produce a family of quasiperiodic unitaries with positive Lyapunov exponents in certain parameter regions. As noted by Zhang, this is often difficult to accomplish. See also.\n\nIt is worth emphasizing that there are two separate categories of challenges that had to be overcome for this work to be written.\nThe first and most substantial challenge is to choose the correct model.\nAt the time when was written, it was not clear how to correctly incorporate coupling constants into the coins, and moreover, the naive guesses turned out to be incorrect.\nAfter, one then was able to disentangle the correct choices from the physical model.\n\nThe second challenge is to suitably recontextualize techniques and ideas from the self-adjoint setting to the unitary setting.\nThis is sometimes easy, sometimes challenging, and sometimes impossible.\nIn the present case, the techniques fell into the first two classes. Our main goal was to present a complete picture in the sense that one observes all three types of cocycle dynamics, precise formulations of duality, and all three spectral types in suitable parameter regions. In order to achieve this while still keeping the length of the paper in check, we have aimed to spend less time on techniques and tools that are obvious generalizations from the self-adjoint setting in order to supply full details for problems that present genuine challenges and required more novel solutions.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L129-133::c5",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L147-151::c7",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L147-151::c7",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 147,
    "end_line": 151,
    "text": "The second challenge is to suitably recontextualize techniques and ideas from the self-adjoint setting to the unitary setting.\nThis is sometimes easy, sometimes challenging, and sometimes impossible.\nIn the present case, the techniques fell into the first two classes. Our main goal was to present a complete picture in the sense that one observes all three types of cocycle dynamics, precise formulations of duality, and all three spectral types in suitable parameter regions. In order to achieve this while still keeping the length of the paper in check, we have aimed to spend less time on techniques and tools that are obvious generalizations from the self-adjoint setting in order to supply full details for problems that present genuine challenges and required more novel solutions.\n\nLet us describe a few of the challenges. First, due to singularities that arise at complex phases in the non-critical cases, the transfer matrix cocycle is singular and hence one cannot immediately use the \"asymptotic cocycle\" method as in previous cases to compute the Lyapunov exponent. We use a topological argument to circumvent this difficulty: we show that the range of the determinant of the cocycle map has trivial winding around the origin in the two \"perturbative\" regions of large and small imaginary parts and use suitable continuity arguments to establish this for all imaginary parts away from the singularities. This is inspired by related works of Jitmirskaya-Marx for the (self-adjoint) extended Harper's model.\n\nThe calculations needed to establish the form of Aubry duality are quite delicate and require several non-obvious changes of coordinates. More generally, because of the more complicated structure of the operator and its transfer matrices, most calculations are more involved than the corresponding self-adjoint counterparts. Furthermore, as mentioned before, it is also not obvious what these analogous calculations should be.\n\nIn the proof of continuous spectrum for the case of critical coupling, we need to deal with the lack of a symplectic symmetry of the cocycle. Concretely, we had to find a novel symmetry of the cocycle which was then different from the symplectic symmetry that is typically used in studying reducibility questions for Schrodinger cocycles. In the Schrodinger setting, one can simply exploit the fact that the transfer matrix is real and so invariant under complex conjugation, whereas the corresponding symmetry we had to use was more complicated.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L137-144::c6",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L153-157::c8",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L153-157::c8",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 153,
    "end_line": 157,
    "text": "In the proof of continuous spectrum for the case of critical coupling, we need to deal with the lack of a symplectic symmetry of the cocycle. Concretely, we had to find a novel symmetry of the cocycle which was then different from the symplectic symmetry that is typically used in studying reducibility questions for Schrodinger cocycles. In the Schrodinger setting, one can simply exploit the fact that the transfer matrix is real and so invariant under complex conjugation, whereas the corresponding symmetry we had to use was more complicated.\n\nMoreover, in several of the arguments, it is needed to relate the transfer matrix cocycle to one in  in order to apply the machinery of such cocycles. However, even after normalization, the cocycle for this model clearly does not belong to ; nevertheless, we found a novel conjugacy from the cocycle into , which again is not at all obvious from the form of the cocycle.\n\nFinally, our operators are not standard CMV matrices but rather generalized CMV matrices, which allow for an additional complex phase in some parameters. This obstacle is the easiest to overcome: any generalized CMV matrix is unitarily equivalent to a genuine CMV matrix by a simple diagonal unitary operator. This allows one to translate results from CMV matrices to generalized CMV matrices with relative ease. For the reader's convenience, we describe this equivalence in Section . This will be discussed more thoroughly together with some additional applications in the forthcoming work.\n\nWe wish to emphasize that, although there are often corresponding results on either the unitary or self-adjoint side, such results are often about classes of operators (periodic, random, quasiperiodic), and not specific models. That is to say, there is to our knowledge no dictionary that explicitly connects properties of Schrodinger operators  with CMV matrices or quantum walks in an explicit fashion.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L147-151::c7",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L159-171::c9",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L159-171::c9",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 159,
    "end_line": 171,
    "text": "We wish to emphasize that, although there are often corresponding results on either the unitary or self-adjoint side, such results are often about classes of operators (periodic, random, quasiperiodic), and not specific models. That is to say, there is to our knowledge no dictionary that explicitly connects properties of Schrodinger operators  with CMV matrices or quantum walks in an explicit fashion.\n\nThe remainder of the paper is structured as follows. We defined the model and state our results in Section . Section  discusses the two-dimensional quantum walks from which the main model of the paper is derived. In Section , we discuss the associated transfer matrix cocycle in detail, characterizing the cocycle dynamics according to Avila's global theory in each parameter region. Section  discusses and proves several manifestations of Aubry duality for the model, which is then put to use in Sections - to prove the remainder of our spectral results.\n\nAcknowledgements D. C. O. was supported in part by three grants from the Fundamental Research Grant Scheme from the Malaysian Ministry of Education (grant numbers  FRGS/1/2022/TK07/XMU/01/1, FRGS/1/2018/STG06/XMU/02/1 and FRGS/1/2020/STG06/XMU/02/1), a grant from the National Natural Science Foundation of China (grant number 12201524), and two Xiamen University Malaysia Research Funds (grant numbers XMUMRF/2023C11/\nIMAT/0024 and XMUMRF/2020-C5/IMAT/0011). C. C. was supported in part by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) under the grant number 441423094. J. F. was supported in part by National Science Foundation grant DMS 2213196 and Simons Foundation Collaboration Grant 711663. The authors are grateful to Chris Marx for helpful conversations and to Luis Velazquez for patiently answering questions related to CMV matrices. The authors are grateful to Svetlana Jitomirskaya and Qi Zhou for helpful comments on an earlier draft and to the anonymous reviewers for helpful comments on this version.\nData Availability Statement  Data sharing is not applicable to this article as no datasets were generated or analysed during the current study.\n\nModel and Results\nSetting",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L153-157::c8",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L173-206::c10",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L173-206::c10",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 173,
    "end_line": 206,
    "text": "Model and Results\nSetting\n\nWe will consider a quantum walk , defined by a quasiperiodic sequence of coins.\nIn the present section, we will define precisely the model, which arises via a one-dimensional representation of a two-dimensional quantum walk in a magnetic field.\nHowever, we emphasize that the one-dimensional model can be defined and studied without reference to the two-dimensional model.  We explain the connection to two-dimensional magnetic quantum walks in detail in Section .\n\nLet us write the standard basis of  as\n\nwhere  denotes the standard basis of  and ,  denotes the standard basis of . For an element , we write its coordinates as  so that\n\nwhere . Viewing , it is natural to also put . Recall that a quantum walk  is specified by the iteration of a suitable unitary operator. Choosing a sequence of unitary coins\n\nand a parameter , the walks we consider are given by\n\nwhere  acts coordinatewise via  (i.e., ) and  is given by\n\nThe reader may readily verify that , , and  are all unitary.\nWe call a walk of the form eq:moddefs:walkDef a split-step walk with coupling constant .\n\nWe are now ready to define our main model. Given coupling constants , a frequency , and a phase , we consider the walk\n\nwhere the coins  are given by\n\nBy an argument using minimality of  and strong operator convergence, there is for each  and irrational  a fixed set  with\n\nWorking out the relevant product, the reader can check that the action of  in coordinates is given as\n*\nSee also Lemma .\n\nFor later use, notice that\n\nBecause of the close parallels between this model and the almost-Mathieu operator (AMO), we propose calling  (an instance of) the unitary almost-Mathieu operator (UAMO).\nThe case  was studied in.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L159-171::c9",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L209-237::c11",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L209-237::c11",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 209,
    "end_line": 237,
    "text": "Because of the close parallels between this model and the almost-Mathieu operator (AMO), we propose calling  (an instance of) the unitary almost-Mathieu operator (UAMO).\nThe case  was studied in.\n\nLet us make a few remarks about the parameters.\n[label=(*)]\nSince , one has\n*\nMoreover, if  denotes the unitary transformation , one can check that\n*\nThus, we take  and do not consider .\n\nIf  is rational, then  is periodic and hence its spectral and dynamical properties are well-understood.\nIf , then , so the spectrum of  is pure point and all walkers are localized for trivial reasons.\nOn the other hand, if  the coin sequence is constant. In analogy with the self-adjoint setting, in which one considers  with  a real coupling constant, the quantity  appears to play a role similar to . In fact, we will see later that the most appropriate analogue of the coupling constant  appears to be\n\nsince we will show (Corollary ) that the Lyapunov exponent is given by  on the spectrum.\nIn particular,  corresponds to , while  corresponds to setting .\nIn fact, the connection to the coupling constant of the almost-Mathieu operator is even stronger than the previous remark suggests. To wit: we will see that the form of Aubry duality for the present walk (modulo some niceties that we will discuss more precisely later in the paper) acts by exchanging  and , similar to the duality transformation  in the case of the AMO (compare). Thus, we have three interesting regimes to study:\n\n1.75\n0.32\n1.7\n.5\n.8ex\n-.7ex\n\n[myblue  Subcritical]  (equivalently, )[myred  Critical]  (equivalently, )[myorange  Supercritical]  (equivalently, )\n\nLater in the paper, we will show that the nomenclature is consistent with the characterization of cocycle dynamics according to Avila's global theory (cf. Theorem ).",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L173-206::c10",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L239-268::c12",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L239-268::c12",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 239,
    "end_line": 268,
    "text": "Later in the paper, we will show that the nomenclature is consistent with the characterization of cocycle dynamics according to Avila's global theory (cf. Theorem ).\n\nNaturally, one is interested in the dynamical behavior of the walk as well, that is, the spreading (or lack thereof) associated with the unitary group . Here we note that (at least for Diophantine ) one appears to observe a transition from ballistic motion in the subcritical regime to diffusive motion in the critical case to localization in the supercritical region. For the frequency  and phase , we plot the standard deviation of the position operator as a function of time in Figure .\n\nResults\n\nLet us now describe our main results. First, we discuss the spectral type in each parameter region for a.e. frequency and phase.\nAssume .\n[label=(*)]\nIf , the spectral type of  is purely absolutely continuous for a.e.  and .\nIf , the spectral type of  is pure point for a.e.  and .\nIf , the spectral type of  is purely singular continuous for generic  and all .\nIf , then  is a Cantor set of zero Lebesgue measure for every irrational .\n\nIf , the spectral type of  is purely singular continuous for all irrational  and all but countably many .\nIf , the spectral type of  is purely singular continuous for all irrational  and a.e. .\n\nFor any ,  , and , the spectral type of  is pure point. For every irrational , .\n\nFor any ,  , and , the spectral type of  is purely absolutely continuous. For every irrational , .\n\nLet us make some comments about Theorem .\n[label=(*)]\nThe result in Theorem . is obtained from the result in Theorem . by duality, so the sets of  are the same in each part.The generic set in Theorem . consists of those irrational  satisfying a suitable Liouville condition, namely,",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L209-237::c11",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L270-280::c13",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L270-280::c13",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 270,
    "end_line": 280,
    "text": "Let us make some comments about Theorem .\n[label=(*)]\nThe result in Theorem . is obtained from the result in Theorem . by duality, so the sets of  are the same in each part.The generic set in Theorem . consists of those irrational  satisfying a suitable Liouville condition, namely,\n\nwhere  denotes the th continued fraction denominator associated with .Theorem . and the case  from Theorem . were proved in and are listed here for the sake of completeness. We remark that the full-measure set of  was written down explicitly in.\nIn the region  numerical evidence suggests that the spectrum is purely singular continuous for all phases. In the self-adjoint AMO setting this was proved in using a particular choice of gauge in which the AMO becomes singular. However, we were unable to apply this gauge to obtain fruitful results in the current model.\n\nParts  and  of Theorem  are trivial and are listed for the sake of completeness.\nNevertheless, for the reader's convenience we have included the proofs to these statements at the end of Section .\n\nIf , , and  is rational, then  has purely absolutely continuous spectrum for every phase.\n\nIf , , and  is rational in lowest terms, then there are two possibilities. If , then again  decouples into an infinite direct sum and has pure point spectrum with eigenvalues of infinite multiplicity corresponding to compactly supported eigenfunctions. Otherwise, the spectrum of  is purely absolutely continuous.\nIn the region , we expect that purely absolutely continuous spectrum holds for all  and  (note that  implies  and  so the examples with compactly supported eigenfunctions do not occur in this regime). The proof of this would take us outside the scope of the current paper; we plan to investigate it in future work.\nThere are two crucial ingredients involved in the proofs of the main results: (1) a suitable version of Aubry duality for the operator family  and (2) a careful analysis of the associated transfer matrix cocycle.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L239-268::c12",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L282-326::c14",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L282-326::c14",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 282,
    "end_line": 326,
    "text": "If , , and  is rational in lowest terms, then there are two possibilities. If , then again  decouples into an infinite direct sum and has pure point spectrum with eigenvalues of infinite multiplicity corresponding to compactly supported eigenfunctions. Otherwise, the spectrum of  is purely absolutely continuous.\nIn the region , we expect that purely absolutely continuous spectrum holds for all  and  (note that  implies  and  so the examples with compactly supported eigenfunctions do not occur in this regime). The proof of this would take us outside the scope of the current paper; we plan to investigate it in future work.\nThere are two crucial ingredients involved in the proofs of the main results: (1) a suitable version of Aubry duality for the operator family  and (2) a careful analysis of the associated transfer matrix cocycle.\n\nThe form of Aubry duality for this model demonstrates that dual of the family  is given by  in a suitable sense.\nLet us make this precise.\nDefine\n\nwhere  denotes the transpose.\n\n[Aubry duality via solutions] Let ,  irrational, and  be given, and suppose  satisfies  for some .\nIf  is defined for  by\n\nwhere  denotes the inverse Fourier transform,\nthen\nfor a.e. . Furthermore, if , then eq:tdualsolution:Wxi=phixi holds for all .\n\nLet us emphasize that  is not assumed to belong to the Hilbert space , so one should interpret  as a finite difference operator in the previous theorem.\nIndeed, when  is an Anderson localized (i.e., exponentially decaying) eigenvector of , then  is in general an extended state: bounded but not decaying.\n\nOne can also express duality of generalized eigenfunctions via suitable direct integrals.  The following formulation is useful.\n\n[Aubry duality via direct integrals] For any , , and ,\n\nwhere  denotes unitary equivalence of operators on .\nLet us note the following elementary consequence of Theorem .\nFor any  and  irrational,\n\nBy minimality and Theorem , we have\n\nas desired.\n\nThe second crucial ingredient in our work is the classification of cocycle behavior in the language of Avila's global theory. To formulate these results, let us recall the general setting. Given  irrational and a continuous map , we may consider the skew product\n\nand its iterates given by , where\n\nfor . The map  is called the quasiperiodic cocycle associated with  and . The Lyapunov exponent of  is given by\n\nIf  is analytic and enjoys an analytic extension to a strip of the form , then for  , we consider the complexified cocycle map\n\nFor each , one can consider the Lyapunov exponent of the complexified cocycle:\n\nIf, in addition, , one says that  is",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L270-280::c13",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L328-360::c15",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L328-360::c15",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 328,
    "end_line": 360,
    "text": "If, in addition, , one says that  is\n\nuniformly hyperbolic if  for all  and constants\nsupercritical if  and  is not uniformly hyerbolic\nsubcritical if  for all  in a strip containing\ncritical if  but  is not subcritical.\n\nLet us now explain how quasiperiodic cocycles arise in the spectral analysis of the operators . To study the spectral problem associated with a walk , one naturally studies the generalized eigenvalue equation  with , which leads to the transfer matrices defined by\n\nWe will show that\n*\nwhenever  and  solves  (see Section  for details).\n\nIn the primary quasiperiodic setting of this paper with coins  given in eq:moddefs:coinDef, this leads naturally to a quasiperiodic cocycle.\nTo describe this more precisely, given , , , , and , define  to be  as in eq:model:transmatDef with  as in eq:moddefs:coinDef, that is,\n\nwhere we adopt the abbreviations\n\nThis defines a cocycle map, whose iterates and Lyapunov exponent may be considered as in eq:cociterates and eq:leDefinition.\n\nWe define\n\nwhich by irrationality of  and Kingman's subadditive ergodic theorem satisfies for each  and a.e. :\n\nLater, we will see  (see eq:AlambdaDet), which naturally implies  for all .\n\nWe will see later that the transfer matrix cocycle map associated with the Aubry dual walk  is given by\n\nIn particular, for  one has , so statements transfer into the dual setting in a straightforward fashion.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L282-326::c14",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L362-377::c16",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L362-377::c16",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 362,
    "end_line": 377,
    "text": "In particular, for  one has , so statements transfer into the dual setting in a straightforward fashion.\n\nOne must be careful in the present setting for two reasons. First, the transfer matrices for the UAMO are not in : indeed they are not even unimodular; this can be solved with a suitable conjugacy that moves the normalized cocycle  into  (we will give a more detailed description later). Second, in the case , the associated cocycle obviously is not analytic and hence the apparatus of global theory cannot be applied directly, even after shifting to the real cocycle. To deal with that, we work with a suitable regularization; in fact, because of singularities that arise off the real axis, we use this regularization even when . To that end, we consider  given by\n\nThe additional prefactor  is chosen so that the Lyapunov exponents of  and  are precisely the same (which we will demonstrate later). The regularized cocycle  is analytic, even for  and one can classify cocycle dynamics throughout all parameter regions.\n\nAs mentioned before, the case  presents some complications with the general nomenclature: the cocycle  is not analytic and the regularized cocycle  has points of singularity at which , so neither can be pushed to  in a simple way. Let us address this case first.\n\nSuppose  is irrational and .\n[label=(*)]\nIf , then  for all  and all .\nIf , then  for all . Indeed,\n\nwith equality if and only if  belongs to the spectrum.\n\nOne could consider calling the behavior in Theorem . \"critical\" and the behavior in Theorem . \"supercritical\", but it should be understood that this is a slight abuse of terminology since those words are generally understood in the literature to refer to  cocycles.\n\nNow let us consider the cases with . In order to apply the relevant results from the global theory, we must work with an  cocycle. There are thus two impediments:  and  in general.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L328-360::c15",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L380-410::c17",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L380-410::c17",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 380,
    "end_line": 410,
    "text": "Now let us consider the cases with . In order to apply the relevant results from the global theory, we must work with an  cocycle. There are thus two impediments:  and  in general.\n\nLet  denote the unitary matrix\n\nand put\n\nFor all , , and ,  defined in eq:selfdual:realifiedAdef is an analytic map  with analytic extension to a strip. Indeed,\n\nfor all , where we recall  and .\n\nHaving conjugated the cocycle into , we can discuss the characterization of  in the language of global theory.\n\nSuppose  is irrational and .\n[label=(*)]\n\nIf , then the cocycle  is subcritical for all . In particular,  for all .If , then the cocycle  is critical for all . In particular,  for all .\nIf , then the cocycle  is supercritical for all . Moreover, the Lyapunov exponent  satisfies\n\nwith equality if and only if  belongs to the spectrum.\n\nBy Theorems  and , one has the following corollary which shows that the Lyapunov exponent can be explicitly computed on the spectrum.\n\nFor any , , , and any , one has\n\nwhere  is given by eq:model:lambda0Def.\n\nThe careful analysis of cocycle dynamics pays dividends for the determination of the spectral type. For instance, we use criticality in an essential manner to prove that the spectrum is a zero-measure Cantor set in the case . Similarly, the subcriticality statement implies that the transfer matrix cocycle is almost reducible on the spectrum by Avila's almost-reducibility conjecture announced in and proved in. One can then apply reducibility theory as in in order to deduce purely absolutely continuous spectrum for all phases. To execute this scheme would take us outside the scope of the current work; we plan to address it in future investigations.\n\nConnection to CMV Matrices",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L362-377::c16",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L412-426::c18",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L412-426::c18",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 412,
    "end_line": 426,
    "text": "Connection to CMV Matrices\n\nLet us make explicit a connection between the current setup and Cantero-Moral-Velazquez\n(CMV) matrices. This generalizes the CGMV connection, which is named after the foundational papers. The CMV matrix is a unitary operator on  that has many applications in in spectral theory and orthogonal polynomials on the unit circle (OPUC). This connection is analogous to the relationship between the Jacobi matrix and orthogonal polynomials on the real line (OPRL). A standard reference for the many connections between the CMV matrix and OPUC is. In situations in which the coefficients are generated by an invertible dynamical system (such as an irrational circle rotation as in this work), is is natural to work with extended CMV matrices, which are the natural analogues acting in .\n\nIn the present work, we need some additional flexibility afforded by complexifying certain parameters, which gives rise to objects we call generalized CMV matrices. However, we will explain how to relate these objects to standard CMV matrices. Let us first define generalized CMV matrices. Let . For each pair\n\nput\n\nGiven sequences of elements , put\n*\nwhere in both cases  acts on . One then takes , which one can check has the matrix representation\n\nwhere all unspecified matrix entries are zero and we have placed a box around the entry corresponding to .\nIf additionally one has  for all , one necessarily has , and we simply call this a standard CMV matrix. In this case, we refer to  as the sequence of Verblunsky coefficients of . If   for some , the reader can check that  preserves  and , so the operator  decomposes as a direct sum of two half-line CMV operators on  and .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L380-410::c17",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L428-450::c19",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L428-450::c19",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 428,
    "end_line": 450,
    "text": "where all unspecified matrix entries are zero and we have placed a box around the entry corresponding to .\nIf additionally one has  for all , one necessarily has , and we simply call this a standard CMV matrix. In this case, we refer to  as the sequence of Verblunsky coefficients of . If   for some , the reader can check that  preserves  and , so the operator  decomposes as a direct sum of two half-line CMV operators on  and .\n\nIn, Cantero, Grunbaum, Moral, and Velazquez observed that one may connect CMV matrices and quantum walks. Since our quantum walk setting is slightly more general than theirs, let us briefly describe this connection. Order the basis of  as follows:\n\nComputing directly, one observes\n*\nThus, writing  in the ordered basis eq:orderedBasis, we get\n\nwhere we have boxed the - entry of .\nThus, if we additionally assume that  for all , we may write\n\nfor some suitable . With this,  can be identified with a generalized CMV matrix with those odd coefficients and such that  for all . In particular, the walk  is equivalent to the generalized CMV matrix  given by\n\nIn view of this connection, each of our main results has an application to a suitable generalized CMV matrix.  We have chosen to begin with quantum walks rather than CMV matrices since it makes more clear the motivation behind choosing our parameters in the manner that we did.\n\nMoreover, every generalized CMV matrix is equivalent to a standard CMV matrix in a simple manner. Since we quote some results from the theory of standard CMV matrices, let us spell this connection out in more detail. The following result in this formulation may be found in; for the reader's convenience, we give the proof. We say that two operators  and  in  are gauge equivalent if there is a diagonal unitary operator  on  such that .\n\nEvery generalized extended CMV matrix is gauge-equivalent to a standard CMV matrix. Indeed, for any sequence , there is a diagonal unitary operator  so that\n\nFor , denote  if  and . Define , ) for , and  for . A direct calculation shows that the diagonal unitary  satisfies .\n\nThe generalized CMV matrix  defined by calElambda12phithetadef is gauge-equivalent to the standard CMV matrix  defined by",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L412-426::c18",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L455-476::c20",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L455-476::c20",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 455,
    "end_line": 476,
    "text": "The generalized CMV matrix  defined by calElambda12phithetadef is gauge-equivalent to the standard CMV matrix  defined by\n\nAs a generalized CMV matrix, there are two other cocycles associated with , namely, the Szego cocycle (cf. ) and the Gesztesy-Zinchenko (GZ) cocycle. Denoting\n\nthe (two-step) Szego cocycle associated with  is given by\n\nand the two-step GZ cocycle is given by\n\nAn equivalence between  and  is given in, and an equivalence between  and  is given in. We have\n\nand\n\nFor all irrational , , , and ,\n\nThis is immediate from eq:szegoAzConjugacy and eq:szegoToGZ.\n\nTogether, Corollaries  and  allow one to apply much of the theory of standard CMV matrices to generalized CMV matrices and in particular to the UAMO.\n\nThe remainder of the paper is organized as follows. In Section , we describe the motivation behind the study of the model in question by relating it to a two-dimensional magnetic quantum walk in a uniform magnetic field. Section  analyzes the transfer matrix cocycle and in particular proves Theorem  as well as Theorems . and .. Section  works out suitable versions of Aubry duality for the model and contains the proofs of Theorems  and . Section  discusses continuous spectrum (that is, the exclusion of eigenvalues) and contains the proof of Theorem . and the \"purely continuous\" half of Theorem .. Section  discusses the phenomenon of zero-measure Cantor spectrum in the critical case and in particular proves Theorems . and .. Section  discusses localization in the supercritical region and spectral consequences, in particular proving Theorems . and ..",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L428-450::c19",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L481-499::c21",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L481-499::c21",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 481,
    "end_line": 499,
    "text": "The remainder of the paper is organized as follows. In Section , we describe the motivation behind the study of the model in question by relating it to a two-dimensional magnetic quantum walk in a uniform magnetic field. Section  analyzes the transfer matrix cocycle and in particular proves Theorem  as well as Theorems . and .. Section  works out suitable versions of Aubry duality for the model and contains the proofs of Theorems  and . Section  discusses continuous spectrum (that is, the exclusion of eigenvalues) and contains the proof of Theorem . and the \"purely continuous\" half of Theorem .. Section  discusses the phenomenon of zero-measure Cantor spectrum in the critical case and in particular proves Theorems . and .. Section  discusses localization in the supercritical region and spectral consequences, in particular proving Theorems . and ..\n\nMotivation: Two-Dimensional Magnetic Quantum Walks\nLet us describe the motivation behind studying quantum walks with quasiperiodic coins as in eq:moddefs:coinDef.\nThe reader who is not interested in the physical origins of the model could skip this section, but it explains why we study the one-dimensional quasiperiodic walks that we choose to study and it also provides some insight into why we could expect such walks to exhibit a suitable version of Aubry duality.\nIndeed, since the almost-Mathieu operator arises from the study of a two-dimensional tight-binding model of an electron subjected to an external magnetic field, the natural starting point of our model is a two-dimensional quantum walk subjected to an external magnetic field. We also direct the reader to for additional insights about the relationship between self-adjoint one-dimensional quasiperiodic and two-dimensional magnetic operators.\n\nAs already mentioned, one can simply start from the model defined in eq:moddefs:walkDef, eq:moddefs:slambdaDef,  and eq:moddefs:coinDef, but it is helpful to see how this arises physically, which also explains the choice of the model.\n\nLet us recall the two-dimensional magnetic QW model of.\nThe state space will be  with orthonormal basis\n\nAs before, view  and write  and . Fix a magnetic flux . In the symmetric gauge, the magnetic translations are given by\nViewing  in the natural manner, we have\n\nwhere  are the corresponding shifts on . Again in the symmetric gauge, one can take\n*\nWe now also introduce the coupling parameter  to get the coupled operators  given by\n*",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L455-476::c20",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L501-522::c22",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L501-522::c22",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 501,
    "end_line": 522,
    "text": "where  are the corresponding shifts on . Again in the symmetric gauge, one can take\n*\nWe now also introduce the coupling parameter  to get the coupled operators  given by\n*\n\nLet us briefly explain the terminology. We call  a \"coupling constant\" to elucidate an analogy with the self-adjoint setting. Namely,  is a parameter that dictates how strongly neighboring sites interact with one another by mediating the strength of the shift relative to the coins. Thus, as  decreases from one to zero, neighboring sites interact less and less and hence are less coupled together. Moreover, the main model of the present paper experiences a phase transition in the coupling constants that is similar to the phase transition exhibited in the self-adjoint Harper's model and that is unitary for each choice of parameters, which in turn requires genuine care in the definition of the model.\n\nDenoting by\n\nwe then want to consider\n*\nsee Figure . The coin  is chosen to be a conjugate of the Hadamard coin, which is a popular choice for an unbiased coin in the quantum walk setting. The particular conjugate is chosen so that our quantum walk has a relatively simple form, yet other choices are possible (see the recent experimental work).\n\nLet us now pass to a universal setting - the rotation algebra , which is the -algebra generated by elements  satisfying the commutation relation\n\nOne obtains  from the matrix algebra  via the following representation. Define  by  and . Here, the \"2\" refers to the dimension of the representation. Presently, we will define the representation  carrying  into . Noting that one indeed has\n\nwe see that this is well-defined. One can then extend to the matrix algebra  in the standard way: . One then obtains  from the algebra via , where\n\nOn the other hand, we can map  into  via  and , where  denotes the shift  and  denotes the multiplication operator",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L481-499::c21",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L524-582::c23",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L524-582::c23",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 524,
    "end_line": 582,
    "text": "On the other hand, we can map  into  via  and , where  denotes the shift  and  denotes the multiplication operator\n\nNote that , so this indeed defines a representation  and hence extends to a representation of the matrix algebras .\nThus, applying  to  yields the operator\n\nwhere  is a coin operator with local coins\n*\n\nClassification of Cocycle Behavior\nIn the following sections we aim at characterizations of the spectrum and spectral properties of .\nThis requires knowledge about the cocycle of its transfer matrices.\nWe begin by describing the transfer matrix formalism for  and the dual equation .\nWe then prove a lower bound on the Lyapunov exponent in the supercritical region via a Herman-type estimate. Afterwards, we completely classify cocycle behavior according to the relationship between the coupling constants.\n\nTransfer matrices\nWe begin by writing  in coordinates.\nSuppose  and  is a split-step walk with coupling constant  and coins  as in eq:moddefs:walkDef.\nFor each , we have\n\nWriting out the coordinates, we have\n*\nproving eq:lemW+. The proof of eq:lemW- is similar.\n\nAnalogously, we can write  in coordinates.\nSuppose  and  is a split-step walk with coupling constant  and coins  as in eq:moddefs:walkDef. For each , we have\n\nThis is almost identical to the proof of Lemma .\n\nSuppose  and  is a split-step walk with coupling constant  and coins  as in eq:moddefs:walkDef.\n[label=(*)]\nIf , , and  is not an off-diagonal matrix, then\n\nwhere  is given by eq:model:transmatDef.\n\nIf , , and  is not an off-diagonal matrix, then\n\nIf  and  is not off-diagonal,\n\nwhich is unimodular.\n\n(a) Beginning with Lemma , plug eq:lemW+ into the eigenvector equation  and shift indices  to obtain\n\nSimilarly, we obtain from eq:lemW-, , and\n)\nThen,  and  give\n\nand\n\nrespectively.\nSolving eq:tm:eigeqDerived2 for\nyields",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L501-522::c22",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L584-623::c24",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L584-623::c24",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 584,
    "end_line": 623,
    "text": "respectively.\nSolving eq:tm:eigeqDerived2 for\nyields\n\nwhich is the bottom row of eq:tm:main1.\nNote that this step uses the assumption that  is not off-diagonal, that is, .\nSolving eq:tm:eigeqDerived1 for  and inserting eq:tm:eigeqDerived3 produces\n*\nconcluding the proof of eq:tm:main1.\n\n(b) Since  is unitary and  is real-symmetric,  and .\nThus, eq:tm:main1dual follows from eq:tm:main1 and noting\n*\n\n(c) For the determinant, we have\n*\nproving eq:tm:main2. Unimodularity of  then follows from unitarity of .\n\nAs a consequence of this formalism, let us note the following result for the primary model of the manuscript.\n\nIf , , and  is irrational, then:\n[label=(*)]\nFor each ,\n\nhas zero Lebesgue measure.\n\nhas no isolated points.\n\nThis is a well-known argument using ergodicity; compare. Since our setting is slightly different than the other settings in which this has been proved, we include the details for the reader's convenience.\nIndeed, the spectral projector  is a weakly measurable function of  that is covariant with respect to the shift , on account of the identity:\n\nBy ergodicity, the trace of  is almost-surely constant in , and the almost-sure constant value must be  or .\nSince , Proposition  implies the eigenspace corresponding to eigenvalue  is always finite-dimensional, and hence we have  for a.e. , proving part . Since an isolated point of the spectrum is necessarily an eigenvalue, part  follows immediately.\n\nIn fact, the reader can check that the conclusions  and  of Proposition  are true when  as long as .\nOf course, one can check that  and  are eigevalues of infinite multiplicity for arbitrary phase, and hence the conclusions do not extend to .\n\nAt this point, one can prove the trivial parts of Theorem .\n\n[Proof of Theorems ., and .]\nSuppose first  and .\nThe transfer matrix cocycle is constant and given by",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L524-582::c23",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L626-669::c25",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L626-669::c25",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 626,
    "end_line": 669,
    "text": "[Proof of Theorems ., and .]\nSuppose first  and .\nThe transfer matrix cocycle is constant and given by\n\nIn particular, the spectral type is purely absolutely continuous by Floquet theory and the spectrum may be computed from the discriminant.\nNormalizing the determinant, we have\n\nand hence\n*\nas desired.\nNow, suppose  (and note that the the cocycle is no longer well-defined).\nIn this case, the shift is given  by , so  is a direct sum of  blocks of the form\n\nand hence has pure point spectral type.\n\nIt is straightforward to check that the eigenvalues of  are\n\nThis shows the spectrum of  is  whenever  is irrational.\n\nThe Herman Estimate\n\nLet us show that the Lyapunov exponent is uniformly positive throughout the region .\n\nLet  be irrational. For all , we have\n\nIn particular,  for all  whenever  and\n\nfor all , , and irrational .\n\nOf course, if , the right-hand side of eq:lyap:hermanbound is nonpositive and hence the content of the theorem is empty in that case.\n\nThe central argument in the proof of Theorem  is Herman's argument via complexification and subharmonicity.\nTo get the sharpest possible inequality, we need to compute exactly a specific integral.\nWe only need the  case for the Herman estimate, but we will need the calculation for nonzero  for the eventual classification of cocycle behavior.\n\nFor all , denote .\nFor  and , one has\n\nWhen , one has  and , so that both sides of  eq:specan:logIntegral are zero for all . Thus, the  case is trivial. For , define\n\nso that . The desired result follows from Jensen's formula applied to .\n\nWith the desired integral in hand, we now prove the theorem. Of course, the Herman estimate will be superseded by the global theory classification; since it is short and self-contained, we include the proof of positivity for the convenience of the reader who is unfamiliar with the Herman argument.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L584-623::c24",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L671-720::c26",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L671-720::c26",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 671,
    "end_line": 720,
    "text": "With the desired integral in hand, we now prove the theorem. Of course, the Herman estimate will be superseded by the global theory classification; since it is short and self-contained, we include the proof of positivity for the convenience of the reader who is unfamiliar with the Herman argument.\n\n[Proof of Theorem ]\nLet , , , and  be given. The transfer matrix cocycle of  is given by eq:AlambdaCocycleDef:\n*\nWe view , , and  as fixed, so we suppress them from the subscripts throughout the argument, simply writing, for instance,  and  instead of  and .\nNote that for fixed , this map is analytic (as a function of ) for  and meromorphic when .\n\nDenote the regularized transfer matrices by :\n\nBy Lemma  (with ), we note that\n\nWrite  and define  to mean  recontextualized as a function of , that is\n\nFinally, let , which one can check is an entire function .\nNotice that\n\nGiven , we define the iterates of  and  in the usual manner (keeping in mind that we are writing the circle multiplicatively here):\n*\nIn view of the identity  and the definion of , one has\n\nfor all .\nSince  is analytic, it follows that  is subharmonic.\nUsing the definition of the Lyapunov exponent, eq:lyap:normNktoNormBk, subharmonicity of , eq:lyap:Nz0form, and Gelfand's formula (in that order), we get\n\nwhere  denotes the spectral radius. One can check that the matrix in the last expression has eigenvalues , which yields\n\nCombining eq:sprBlambda1 with eq:lyap:LBtolog+spr and putting this together with eq:lyap:LBztoLAzViaRes, we have obtained\n\nwhich concludes the proof.\n\nAnalytic One-Frequency Cocycles: A Brief Review\n\nLet  be continuous and  irrational.\nRecall from eq:cociterates that the iterates of  are given by\n\nand the Lyapunov exponents of the cocycle  are given by\n\nIn eq:cocycle:L2def,  simply computes the smaller singular value and hence one should interpret  if  is not invertible.\nWe will focus almost exclusively on the upper Lyapunov exponent and hence simply write  instead of .\n\nWe say that  enjoys a dominated splitting if there is a continuous splitting  into one-dimensional subspaces with",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L626-669::c25",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L722-757::c27",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L722-757::c27",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 722,
    "end_line": 757,
    "text": "We say that  enjoys a dominated splitting if there is a continuous splitting  into one-dimensional subspaces with\n\nand such that there exists  such that\n\nfor all  and all unit vectors\n\nIf in addition  is analytic with an analytic extension to a strip , we may consider the complexified cocycle map and its Lyapunov exponent as in eq:complexifiedMdef and eq:complexifiedLEdef: .\n\nThe acceleration of  is defined by\n\nMore generally, for  we also denote\n\nLet us collect the main properties of this apparatus.\nFor details and proofs, we direct the reader to Avila (who proved the result for unimodular cocycles) and Jitomirskaya-Marx (who extended the result to singular cocycles). See also Avila-Jitomirskaya-Sadel for the generalization to higher dimensions.\n\n[Avila, Jitomirskaya-Marx] Suppose  is analytic with an analytic extension to the strip .\n[label=(*)]\nThe function  is continuous, convex, and piecewise affine.\n\nfor all .\n\nIf  for all , then  for all .\n\nIf  and  is affine on a neighborhood of , then  enjoys a dominated splitting.\n\nAs soon as one has an invertible cocycle , one can attempt to push into the unimodular setting by considering the normalized cocycle .\nThus, as discussed in, for invertible (that is, ) cocycles, the central issue is whether  enjoys  holomorphic square root, and this is precisely where the \"\" in Theorem  comes from. Namely, if  has a holomorphic square root, then one can  apply Avila's result to  without further complication.\nOtherwise, one can check that  enjoys a holomorphic square root of period  and hence one can apply Avila's work to a cocycle with doubled period.\n\nAside from the importance as an idea in dynamical systems, the notion of a dominated splitting plays a crucial role in the current paper by determining the complement of the spectrum. To spell this out in detail, we need to define the regularized GZ cocycle. Concretely, put\n\ndefine",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L671-720::c26",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L759-779::c28",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L759-779::c28",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 759,
    "end_line": 779,
    "text": "define\n\nand note that  arises from  in eq:GZcocycledef by clearing denominators.\n\nAs a consequence of a general result in, one has the following characterization of the almost-sure spectrum:\nIf  is irrational, then\n\nThe first line is an immediate consequence of, (and the fact that translation by  is a strictly ergodic isometry of ) while the second follows from the definitions of and relationship between the various cocycles. Concretely, apply eq:Blambdaearlydef, eq:szegoAzConjugacy, eq:szegoToGZ, and eq:tildeGlamdef in that order to see that  enjoys a dominated splitting if and only if  does.\n\nClassification of Cocycles for the UAMO\n\nRecall that the cocycle map  is given by eq:AlambdaCocycleDef and the regularized cocyle  is given by eq:cocycle:BzRegularizedDef.\nAs before, to keep the notation cleaner in this section, we view  and  as fixed and suppress them from the notation, writing  and  for  and .\n\nLet us point out the following:  is always analytic, but (as we will see shortly),  has singularities at some complex phases.\nWe will see concrete manifestations of this in the graph of , which we will see is not convex. However, it is convex on subintervals of the -axis that avoid values of  for which  has singularities. We will  see that there are two such values when  and only one when , and moreover the exceptional values of  are explicit functions of the coupling constant attached to the coin sequence. Indeed, let us define  by\n\n(formally allowing  when ). Recalling Lemma , the Lyapunov exponents of the complexifications of the cocycles  and  are related via\n\nIn particular,  whenever .",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L722-757::c27",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L782-817::c29",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L782-817::c29",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 782,
    "end_line": 817,
    "text": "In particular,  whenever .\n\nWe begin with our first key technical result: by Proposition\nso  is not always a unimodular cocycle.\nNevertheless, the acceleration of  and the acceleration of all cocycles arising from  via complexification of the phase are always integer-valued.\n\nFix ,  , , and , and let  and . We have\n\nwhere  is as in eq:cocycle:eps0Def.\n\nCase 1: . In this case,  and  are constant cocycles, so the result follows.\n\nCase 2: . In view of eq:cocycle:LAtoLB, it suffices to prove  for all .\nWrite , recall eq:AlambdaDet, and apply the sum identity for cosine to get\n\nRecall that  is given by eq:cocycle:eps0Def.\nNote that the denominator of eq:cocycle:cxADet vanishes if and only if  and  or  and .\nIn particular, the cocycle  has singularities when  and is analytic otherwise.\nSimilarly, the numerator of eq:cocycle:cxADet has a root if and only if .\n\nSince , a direct calculation (using Proposition ) yields\n\nIn particular, the image of  lies in a simply connected subset of  and hence  has trivial winding around the origin.\nSince  for all  with ,\n\nfor all .\nSimilarly, one can check that if  is sufficiently large,\n\nConsequently,  has trivial winding around zero for such large , and hence eq:cocycle:winding also holds true for all .\nThus, for all ,  enjoys a holomorphic square root, so eq:cocycle:accelAB for  and  follows by applying Theorem  to .\nAs discussed above, the claim for  follows by applying eq:cocycle:LAtoLB; the extension to  follows from continuity and piecewise affinity of .\n\nCase 3: . Notice that  is an analytic  cocycle for all .\nThus, the result for  at nonzero  follows immediately from Theorem . The extension to  uses eq:cocycle:LAtoLB and properties of  as before.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L759-779::c28",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L821-879::c30",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L821-879::c30",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 821,
    "end_line": 879,
    "text": "Case 3: . Notice that  is an analytic  cocycle for all .\nThus, the result for  at nonzero  follows immediately from Theorem . The extension to  uses eq:cocycle:LAtoLB and properties of  as before.\n\nThe central idea is now to analyze the behavior as , then use quantization of acceleration, continuity, and convexity to bring this information to  near zero.\nThe key technical result is the following asymptotic calculation for the regularized cocycle.\nFix ,  , , and , and let .\nFor all  sufficiently large,\n\nMoreover,  is an even function of .\n\nDefine  by\n*\nNaturally, one has\n\nfor any . Define\n\nNotice that the convergence is uniform in .\nUsing eq:sprBlambda1, we can directly calculate the Lyapunov exponent of the cocycle  via\n\nBy eq:cocycle:BinftLE, quantization of acceleration, convexity, and continuity of the Lyapunov exponent we get\n\nBy eq:cocyc:LBepsLargeAbsVal, convexity, and quantization of acceleration,  is even.\n\nV> m.4\n\nAs discussed in Section , the remaining technical task is to show that  is conjugate to an  cocycle, which is the content of Proposition .\n\n[Proof of Proposition ]\nDenoting\n\none can easily check  and .\nBy a straightforward calculation, one may check that  belongs to  , that is,\n*\nfor any , , , and .\nMoreover, one can confirm that\n\nwhere  is as in eq:selfdual:YlamDef. In view of the discussion in, this implies that .\n\nThe form of  in eq:realifiedcocycleexplicit follows from direct calculations. As discussed previously, we may analytically choose the branch of the square root, so analyticity follows immediately. Alternatively, analyticity is obvious from eq:realifiedcocycleexplicit.\n\nAt last, we may combine all of these tools and conclude with the proofs of the main statements regarding the cocycles.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L782-817::c29",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L882-913::c31",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L882-913::c31",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 882,
    "end_line": 913,
    "text": "At last, we may combine all of these tools and conclude with the proofs of the main statements regarding the cocycles.\n\n[Proof of Theorem ]\nLet  be given. First, notice that the Lyapunov exponents of , , and  all coincide in a strip, that is,\nwhich holds on account of eq:AlambdaDet and Lemma . Since , the strip has positive width. Thus, to conclude the desired statements about , it suffices to prove suitable statements about the shape of the graph of  near .\nFrom here, the proofs of the three statements are nearly identical, so we only write the details for the proof of part , since it requires some additional work compared to the other two.\n\nIn part   , so that\n\nConsider  and let  be the associated cocycle map.\nBy Proposition ,  whenever  is very large.\nBy quantization of acceleration, convexity, and evenness of the function , there are two possibilities.\n\nCase 1:  for some . In this case,  is positive and affine in a neighborhood of , which implies that  enjoys a dominated splitting, and hence that  by Theorem .\n\nCase 2:  for all . By the previously discussed properties of , we have\n\nIn view of eq:cocycle:LAtoLB, eq:cocycle:exactFormOfB yields\n\nIn particular, this implies that  belongs to  and that , as desired, where  is given by eq:model:lambda0Def.\n\nIn thinking about the proof of Theorem , the reader may find it helpful to consult Figure .\n\n[Proof of Theorem ]\nPart  is proved in. Simply note that  in the notation of. Part  follows directly from Proposition  using the same argument used to prove part  of Theorem .\n\nAubry-Andre Duality",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L821-879::c30",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L915-967::c32",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L915-967::c32",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 915,
    "end_line": 967,
    "text": "Aubry-Andre Duality\n\nOne crucial aspect of the model is that it enjoys a version of Aubry duality.\nWe will describe two formulations of duality, each of which expresses self-similarity of the operator families  and , both of which are useful.\nThe first manifestation of duality shows how to relate solutions of the eigenvalue equation  to formal solutions of the dual equation .\nThe second manifestation of duality expresses a unitary equivalence between the direct integrals of the families  and  via the Fourier transform.\n\nDuality via Solutions\nFor , we denote its inverse Fourier transform by , which is defined for absolutely summable  by\n\nGiven , let us define (motivated by eq:models:dualSolutionDef):\n\n[Proof of Theorem ]\nFrom eq:lemW+ and , we have\n*\nTaking the inverse Fourier transform of both sides, shifting the indices of the terms containing , and substituting the explicit form of  from eq:moddefs:coinDef yields\n*\nfor a.e. .\nUsing the exponential formulations of sine and cosine, and expressing in terms of the inverse Fourier transform this becomes\n*\nfor a.e. .\nRearranging to collect like terms yields\n*\nfor a.e. .\n\nApplying the same steps to eq:lemW- yields\n*\nfor a.e. .\n\nFrom these expressions for  and , we obtain for\n*\nWriting  and sorting the terms, this amounts to\n*\n\nThus, choosing  and , respectively, and setting  and  as in eq:phidef we obtain\n\nTo conclude the proof, we apply  to  and write . Thus from  Lemma  we have in coordinates:\n*\nwhere we used eq:phiplus. An analogous calculation shows that .\n\nDuality via Direct Integrals\n\nRecalling , let us define\n\nWe write the coordinates of  as  where , , and .\nFor , let  be its Fourier transform, given by\n\nThe Aubry dual operator is given by , where\n\nWe also define  by\n\n[Aubry Duality for Operators] For all , and irrational ,",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L882-913::c31",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L971-1012::c33",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L971-1012::c33",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 971,
    "end_line": 1012,
    "text": "[Aubry Duality for Operators] For all , and irrational ,\n\nRecall that every one-dimensional quantum walk can be related by an extended CMV matrix via the CGMV connection and that one can recover the  factorization of the associated CMV matrix by inserting an infinite direct sum of 's, viz.: , where  denotes an infinite direct sum of copies of . This motivates one to define operators , , and  on  by\n*\nand denote the corresponding direct integrals by\n\nOne deduces\n\nfrom the pointwise identity .\nFrom the calculation\n*\nwe get\n\nTaking the transpose of both sides of eq:aubry:UtoV establishes\n\nNext, we show\n\nIndeed, from the definitions,\n*\nA similar argument works for the spin-down component, proving eq:aubry:JtoVT\nFinally, we show\n\nCalculating  gives\n*\nThe other component of eq:aubry:VtoJ is similar.\nPutting together eq:aubry:W=JU, eq:aubry:UtoV, eq:aubry:UTtoVT, and eq:aubry:JtoVT, eq:aubry:VtoJ (and using ), we get\n*\nsince .\n[Proof of Theorem ]\nSince  and  are unitary, this is an immediate consequence of Theorem .\n\nContinuous Spectrum",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L915-967::c32",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1014-1025::c34",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1014-1025::c34",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1014,
    "end_line": 1025,
    "text": "Continuous Spectrum\n\nHaving studied the Lyapunov exponent and cocycle dynamics in detail, we now move towards the analysis of the spectrum and spectral type of .\nWe begin in the current section with results on continuous spectrum; equivalently, we prove several results that establish the absence of eigenvalues, which is equivalent to continuity of spectral measures.\nWe present three results, each of which covers a particular paramter region. We begin with the sharp Gordon argument showing that for suitable Liouville numbers (dependent on the coupling via the Lyapunov exponent), the spectrum is purely continuous.\nCoupled with positivity of the Lyapunov exponent in the supercritical region, this immediately yields singular continuous spectrum.\nNext, we show continuous spectrum in the self-dual region for all irrational  and all but countably many .\nLater on, we will show that the spectrum has zero Lebesgue measure in the self-dual region so this shall again yield purely singular continuous spectrum for each irrational frequency and all but countably many phases.\nFinally, we show that this (i.e., purely continuous spectrum) holds uniformly in the frequency and phase in the subcritical region.\n\nLiouville Fields: Sharp Gordon Criterion\n\nWe begin with Theorem .. This is a combination of two facts: absence of absolutely continuous spectrum, which follows from positivity of the Lyapunov exponent and Kotani theory and absence of eigenvalues, which follows from Gordon-type arguments. By applying Gordon's lemma for CMV matrices, one can immediately see that the spectral type is purely continuous whenever  is Liouville.\nIn fact, by using the sharp Gordon criterion as in, one can prove singular continuous spectrum for all  above a suitable arithmetic threshold dictated by the Lyapunov exponent.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L971-1012::c33",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1028-1050::c35",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1028-1050::c35",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1028,
    "end_line": 1050,
    "text": "We begin with Theorem .. This is a combination of two facts: absence of absolutely continuous spectrum, which follows from positivity of the Lyapunov exponent and Kotani theory and absence of eigenvalues, which follows from Gordon-type arguments. By applying Gordon's lemma for CMV matrices, one can immediately see that the spectral type is purely continuous whenever  is Liouville.\nIn fact, by using the sharp Gordon criterion as in, one can prove singular continuous spectrum for all  above a suitable arithmetic threshold dictated by the Lyapunov exponent.\n\nGiven  irrational, let  denote the continued fraction convergents of  and\n\nIf  and\n\nthen  has purely singular continuous spectrum for every .\n\nSuppose .\nBy Theorem ., the Lyapunov exponent is uniformly positive and given by\n\nfor .\nBy Kotani theory, the a.c. spectrum of  is absent for a.e. . More precisely, recalling the gauge equivalence of  and  as in Corollary  and the equivalence between the Szego cocycle and the cocycle  in Corollary , the absence of a.c. spectrum follows from.\nBy minimality then, the absolutely continuous spectrum is empty for all  by the Last-Simon theorem for CMV matrices; cf. .\n\nOn the other hand, using the exact form of the Lyapunov exponent from eq:contspec:gordonLEexact and the sharp Gordon criterion, which was worked out for CMV matrices in Li-Damanik-Zhou (see), one sees that every spectral measure is continuous. More precisely, the desired absence of eigenvalues may be deduced from the argument of after taking two things into account. First, use the gauge equivalence of  and  as in Corollary  to equate purely continuous spectrum for  with that of . Second, apply a nearly-verbatim repetition of the arguments of for  by passing to blocks of length two; that is, work with the two-step Szego cocycle as in eq:szegococycledef, which is genuinely quasiperiodic (and which belongs to ), enabling the application of their techniques.\n\n[Proof of Theorem .]\nSince the set of  with  is known to be residual, this follows immediately from Theorem .\n\nContinuous Spectrum in the Critical Regime",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1014-1025::c34",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1053-1079::c36",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1053-1079::c36",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1053,
    "end_line": 1079,
    "text": "Continuous Spectrum in the Critical Regime\n\nWe now discuss the critical case. Later in the manuscript, we will show that when , the spectrum is a Cantor set of zero Lebesgue measure and hence cannot support any absolutely continuous spectrum. To classify the spectral type, it then remains to see whether there may be any eigenvalues. We will see that in the critical case , the point spectrum is empty away from a countable set of phases, and the set of exceptional phases is an explicit subset defined by possible reflection symmetries of the coins:\n\nIf  is irrational, we say that  is irrational with respect to  if  every .\nOtherwise, we say  is rational with respect to .\n\nOur primary goal in the present section is to prove the following theorem. The proof follows the overall structure of (see also), but there are several complications arising from the more involved structure of the cocycle. Additionally, the reflection symmetry of the cocycle as in Proposition  is different from that in the self-adjoint case and required novel analysis to find.\n\nConsider .\nFor every irrational  and every  for which  is irrational with respect to , the operator  has empty point spectrum.\n\nThe theorem is clearly false if . When , it holds in a more restricted form (namely, for all irrational  and a.e. ).\nNaturally, for a given irrational , there are only countably many  that are rational with respect to , so this suffices to establish the continuity half of Theorem ..\n\nFor the work ahead, we need to note a reflection symmetry of the cocycles.\n\nLet , , and  be given, let  denote the cocycle defined in eq:AlambdaCocycleDef, and let  denote the dual cocycle from eq:models:Asharpdef. For all , one has\n\nwhere\n\nNote that the inverse of  is given by\n\nOne has",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1028-1050::c35",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1081-1120::c37",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1081-1120::c37",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1081,
    "end_line": 1120,
    "text": "One has\n\nso, exploiting  and  give us\n*\nproving eq:pi/2inverse. The identity eq:pi/2inverseDual follows immediately from eq:pi/2inverse and eq:models:Asharpdef.\nCrucial in the proof of Theorem  is a dynamical reformulation of duality, which we presently make precise. If  is an -eigenfunction of , then Theorem  implies that  is a solution of  for a.e.  (with  defined by eq:phidef). Consequently, we have\n\nfor a.e. , with  defined in eq:models:Asharpdef.\nNow, substitute  for  and apply eq:pi/2inverse to get\n\nUse eq:AlambdaDet and the definition of  to see\n\nPutting together eq:contspec:dualTM1 and eq:contspec:dualTM2b, we get\n\nwhere\n\n[Proof of Theorem ]\nLet ,  irrational, and  irrational with respect to  be given, and assume on the contrary that  has nonempty point spectrum. Let  denote a normalized eigenfunction with corresponding eigenvalue .\nDefine  by eq:phidef and consider  as in eq:Mreducible.\nSince , eq:reducibility implies that . By ergodicity of  on ,  is a.e. constant with respect to .\n\nAlso  for a.e. , since if not,  for a.e.  by eq:reducibility and ergodicity of . However, this would imply  vanishes for a.e. , which contradicts nontriviality of the eigenfunction  that generates .\n\nNext we prove that  for a.e. .\nAssume for the sake of contradiction that  on a positive-measure set. Since  is a.e. constant, one has  a.e, which means that the columns of  are linearly dependent for a.e. .\nEquivalently, there is a function  with  such that\n\nUsing eq:ell, eq:reducibility, eq:ell, and again eq:reducibility we have\n\nwhich implies  for a.e. .\nFourier expanding  this gives\n\nSince  is irrational with respect to , we have  for all . Combined with eq:contspec:ellFourierResult, this implies that all Fourier coefficients of  must vanish, forcing , a contradiction.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1053-1079::c36",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1123-1152::c38",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1123-1152::c38",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1123,
    "end_line": 1152,
    "text": "Since  is irrational with respect to , we have  for all . Combined with eq:contspec:ellFourierResult, this implies that all Fourier coefficients of  must vanish, forcing , a contradiction.\n\nLet us now consider for  the -step transfer matrix given by\n\nwhere we choose notation consistent with eq:cociterates.\nThen, by eq:reducibility\n\nWe define\n\nand note that\n\nSince we have the inequality  and the identity , we have\n\nBy the Cauchy-Schwarz inequality,\n\nNote that  is finite by unitarity of the inverse Fourier transform. This also implies that   can be made arbitrarily small by making  sufficiently small. We then have\n\nOn the other hand, by eq:AlambdaCocycleDef,  eq:models:Asharpdef, and eq:Psi^n we notice that  is a trigonometric polynomial divided by\n\nBy we can control this quantity with the help of Lemma  with . Thus we can modify eq:L1=0 to be\n\nWe observe from eq:Psi^nb that\n\nIt is clear that the second term on the right hand side of the above equation is a constant multiple of the trigonometric polynomial, , (recall that  is currently fixed).\nBy eq:AlambdaCocycleDef and eq:models:Asharpdef, it is also true that  is a trigonometric polynomial. We will estimate the leading coefficients of these  trigonometric polynomials, that is, the coefficients of the  and  terms. One sees immediately that the leading coefficients of  have absolute value .\n\nNext, we examine the leading coefficient of  term of eq:QPsi. Recall by eq:Qn that  is a product of  terms, and by eq:AAubryDualn  is a product of  terms. Thus to understand  we multiply out . Since we are trying to express  as a trigonometric polynomial, we are only concerned with terms that are multiples of , since only these terms produce trigonometric expressions. So separating out the terms that are multiples of , we have",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1081-1120::c37",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1154-1187::c39",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1154-1187::c39",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1154,
    "end_line": 1187,
    "text": "Next, we examine the leading coefficient of  term of eq:QPsi. Recall by eq:Qn that  is a product of  terms, and by eq:AAubryDualn  is a product of  terms. Thus to understand  we multiply out . Since we are trying to express  as a trigonometric polynomial, we are only concerned with terms that are multiples of , since only these terms produce trigonometric expressions. So separating out the terms that are multiples of , we have\n\nwhere  is a matrix that does not depend on . We want to compute the leading coefficients of   expressed as a trigonometric polynomial. Note that this is a product of the  expressions of the form eq:lambdaMatrix with . The leading terms of the trigonometric polynomial will be multiples of  and . The only way to obtain terms of the form  and  from  is by multiplying  sines in eq:lambdaMatrix, from . Thus we can see that these coefficients of these terms are obtained from calculating .\nOne can check that  has eigenvalues  (compare eq:sprBlambda1).\nDiagonalizing  explicitly, we have the following for :\n\nThus, the leading coefficient of  has absolute value .\nBut then, writing  for the leading coefficient of , this all means that\n\nas . However,\n\nso eq:selfdualcontspec:contra contradicts eq:L1=0.Q, which concludes the proof.\n\nThe Subcritical Regime\n\nThe duality in Theorem  together with the positivity of the Lyapunov exponent of the dual model in Theorem  allows us to exclude point spectrum in the subcritical region for all phases  and all irrational fields  by Delyon's argument.\nLet  be irrational and .\nFor every , the point spectrum of  is empty.\n\nThis follows from an argument of Delyon.\nArguing by contradiction, assume that for some  the operator  has an eigenvalue  with corresponding eigenvector  normalized by .\nApplying Theorem , it follows that   given by\n*\nwith  as in eq:phidef is a formal eigenfunction of  for a.e. .\nNote that the inverse Fourier transform of  is only defined almost everywhere on , so  itself is only defined for a.e. .\n\nMoreover, by unitarity of the inverse Fourier transform, one also has .\nConsequently, for every  we have\n*\nConsequently, for a.e.  and any , there exists  such that",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1123-1152::c38",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1189-1224::c40",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1189-1224::c40",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1189,
    "end_line": 1224,
    "text": "Moreover, by unitarity of the inverse Fourier transform, one also has .\nConsequently, for every  we have\n*\nConsequently, for a.e.  and any , there exists  such that\n\nHowever, since , this contradicts positivity of the Lyapunov exponent associated with the dual model (cf. Theorem ).\nThis is a standard argument, but let us provide the details for the reader's convenience.\nFirst, for any fixed , the set of  for which  is an eigenvalue of  is a Lebesgue null set (by Proposition ).\nConsequently, by the multiplicative ergodic theorem, one must have that  grows exponentially on at least one half-line for a positive-measure set of , in contradiction with eq:contspec:spuriousLinBd.\n\nZero-Measure Cantor Spectrum\nWe now discuss the proof of zero-measure Cantor spectrum in the critical case .\nAs noted before,  was shown to be a zero-measure Cantor set in. On the other hand, it is trivial to see that , so the assumption  is necessary for the Cantor spectrum result (though obviously not for the zero-measure result). In view of these comments, we focus on  in the present section.\n\nThe proof of Theorem . will follow from the general theory of analytic  cocycles as developed in.\n\nFor every ,  and ,  is homotopic to a constant.\n\nThis is a straightforward calculation.\n\nIn order to apply the well-developed machinery of real-analytic cocycles, it is helpful to note that the cocycle is monotonic in the argument of the spectral parameter. This is a straightforward (albeit cumbersome) calculation. For the reader's convenience, we supply the details.\n\nFor  and ,  is monotonic in  in the following sense: for any  and any  (any determination of) the argument of  has positive derivative with respect to .\n\nWe will need the following elementary calculation.\nSuppose . If  and , then\n\nfor all .\n\nFirst, observe that\n\nSince eq:0meas:triglemma1 is strict whenever  and eq:0meas:triglemma2 is strict whenever , the lemma is proved.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1154-1187::c39",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1227-1272::c41",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1227-1272::c41",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1227,
    "end_line": 1272,
    "text": "Since eq:0meas:triglemma1 is strict whenever  and eq:0meas:triglemma2 is strict whenever , the lemma is proved.\n\n[Proof of Lemma ]\nLet , , and  be given. Of course, positive scalar multiples do not affect the argument of a vector, so we may consider\n*\nWrite , consider , and define  by\n\nSince , computing the derivative of the argument of  with respect to  (and denoting the derivative with respect to  by a dot) gives\n\nThus, we are left with considering . We have\n\nwhere\n\nNote that the assumptions  and  imply . After some algebra, one gets\n\nwhich is strictly positive by the assumption . Combining eq:0meas:monotonicargdot1, eq:0meas:monotonicargdot2, eq:0meas:monotonica, eq:0meas:monotonicb, eq:0meas:monotonicc, and eq:0meas:monotonicdisc with Lemma  we get\n\nwhich concludes the proof.\n\nGiven , , and , let\n\nFor , we say that an  cocycle  is -reducible to rotations if there exists  such that\n\nFor Lebesgue almost every ,  is -reducible to rotations.\n\nThis follows from Lemma  and.\n\nFor Lebesgue almost every ,  is -reducible to rotations.\n\nThis follows from Lemma , real-analyticity of , and Avila-Fayad-Krikorian; see and its proof.\nSee also the discussion on. More precisely, yields the desired reducibility for a.e. rotation number. To pass from a.e. rotation number to a.e. , one uses the relationship between the rotation number for the Szego cocycle and the density of states for the CMV matrix, Kotani theory for CMV matrices, and the Kotani formula for the derivative of the CMV density of states on the vanishing set of the Lyapunov exponent.\n\nLet us supply some additional details for the reader's convenience. For , let  denote the spectral measure  given by\n\nand recall that the density of states measure  associated with the family  is given by the average of the spectral measures:",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1189-1224::c40",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1274-1306::c42",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1274-1306::c42",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1274,
    "end_line": 1306,
    "text": "and recall that the density of states measure  associated with the family  is given by the average of the spectral measures:\n\nKeeping in mind the equivalence between  and an extended CMV matrix as in Corollary , the result of together with Kotani theory for ergodic CMV matrices implies\n\nfor Lebesgue a.e. . Let  denote the rotation number of the Szego cocycle. By, , so eq:zeromeas:dnodphi holds for a.e.  with  replaced by . This suffices to conclude the argument.\n\nFor Lebesgue almost every , the cocycle  is subcritical.\n\nThis follows from Lemma  and eq:selfdual:realifiedAdef.\n\nOf course, we have already shown that subcriticality is absent for , so the crucial consequence of Lemma  is that  (and hence  has zero Lebesgue measure.\n\nPutting all of this together, we may prove the desired zero-measure Cantor result in the critical regime.\n\n[Proof of Theorem .]\nThe case  was proved in, so let us consider . By Proposition , the spectrum lacks isolated points. By Theorem , we have . If the measure of the spectrum is zero, it follows that the spectrum has empty interior and cannot support any absolutely continuous measures. Thus, it suffices to show that the measure of  is zero.\n\nHowever, this is immediate from Lemma  and Theorem ..\nNamely, if the measure of  were positive, Lemma  would imply subcriticality of  for a positive-measure set of , which contradicts Theorem ..\n\n[Proof of Theorem .]\nSince a zero-measure set cannot support absolutely continuous measures, this is an immediate consequence of Theorems . and .\n\nLocalization in the Supercritical Region and Consequences\n\nAt last, we conclude by discussing localization.\nBeginning from positivity of the Lyapunov exponent, which follows from the bound\n\nwhen , there is a cornucopia of techniques that one could apply in order to prove Anderson localization for  (for a.e. ).",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1227-1272::c41",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1308-1323::c43",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1308-1323::c43",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1308,
    "end_line": 1323,
    "text": "when , there is a cornucopia of techniques that one could apply in order to prove Anderson localization for  (for a.e. ).\n\nWe note that the non-perturbative localization proof of Bourgain-Goldstein, generalized to CMV matrices by Wang-Damanik, suffices for our purposes.\nWe expect that most of the other localization techniques that have been employed in the study of self-adjoint quasiperiodic operators will find fruitful application here.\nFor instance, we expect Jitomirskaya's proof of localization for the self-adjoint supercritical almost Mathieu operator with Diohphantine frequency and nonresonant phase  and Avila-Jitomirskaya's proof of almost-localization  can be generalized to the present setting.\nWe plan to address this and other finer localization statements in forthcoming work.(Note added in revision: The first goal was accomplished in.)\n\n[Proof of Theorem .]\nConsider ,\nand recall from Corollaries  and  that  is unitarily equivalent to the CMV matrix  and that the cocycle  is conjugate to the (two-step) Szego cocycle . In particular, Theorem  gives\n\nfor all , so the assumptions of are met with  the set of all irrationals and .(The reader will notice that our Verblunsky coefficients have an alternating quasi-periodic structure, so formally, does not directly apply. However, passing to blocks of length two, one can re-run the arguments of with cosmetic changes to deduce the desired localization statement.)\nAs such, we get for each  a full-measure set of  for which  enjoys Anderson localization.\nThe conclusion then follows by Fubini's theorem.\n\nWe may thus conclude the proofs of Theorem . by leveraging Theorem . and duality.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1274-1306::c42",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1325-1335::c44",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1325-1335::c44",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1325,
    "end_line": 1335,
    "text": "We may thus conclude the proofs of Theorem . by leveraging Theorem . and duality.\n\n[Proof of Theorem .]\nThis follows from Theorem . and Aubry duality via standard arguments, which we describe for the reader's convenience.\nLet  be given, and let  be taken from the full-measure set of Diophantine irrationals for which  is almost-surely localized.\nDefine\n\nBy assumption  supports the spectral measures of  for a.e. , and hence also supports a.e. spectral measure of  by duality (cf. Theorem ) and general facts about direct integrals which may be found in most texts on operator theory; see, e.g.,. Let us describe this in more detail. Denoting , one has\n\nfor a.e.  since  supports the spectral measures of  for a.e. . By Theorem  and the functional calculus for direct integrals, this in turn implies\nfor a.e.  and hence that  supports the spectral measures of  for a.e. .\nOn the other hand, for each , duality at the level of solutions (i.e., Theorem ) shows that all solutions to  are bounded, and hence (for a.e. phase) the dual model has no subordinate solutions on .\nRecalling the gauge equivalence of  and  as in Corollary , we note that  has a subordinate solution at spectral parameter  if and only if  has a subordinate solution at spectral parameter . Consequently, we may apply subordinacy theory for standard CMV matrices as in. We see that  has purely absolutely continuous spectrum on , hence purely absolutely continuous spectrum, concluding the argument.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1308-1323::c43",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1337-1379::c45",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1337-1379::c45",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1337,
    "end_line": 1379,
    "text": "for a.e.  since  supports the spectral measures of  for a.e. . By Theorem  and the functional calculus for direct integrals, this in turn implies\nfor a.e.  and hence that  supports the spectral measures of  for a.e. .\nOn the other hand, for each , duality at the level of solutions (i.e., Theorem ) shows that all solutions to  are bounded, and hence (for a.e. phase) the dual model has no subordinate solutions on .\nRecalling the gauge equivalence of  and  as in Corollary , we note that  has a subordinate solution at spectral parameter  if and only if  has a subordinate solution at spectral parameter . Consequently, we may apply subordinacy theory for standard CMV matrices as in. We see that  has purely absolutely continuous spectrum on , hence purely absolutely continuous spectrum, concluding the argument.\n\nThere is another proof of  Theorem . which we now sketch for the interested reader:\n[Sketch of alternate proof of Theorem .]\nLet  denote the density of states of  as in eq:DOSDEF, and let  denote the density of states associated to the dual model. Since  (defined in frakEDEF) supports the spectral measure of the dual model for a.e. phase, it supports . By Aubry duality, , so  supports  and hence the spectral measure of  for a.e. . One concludes using subordinacy theory as above.\n\nabbrvArXiv\n\nY. Aharonov, L. Davidovich, and N. Zagury.\nQuantum random walks.\nPhys. Rev. A, 48:1687-1690, 1993.\n\nA. Ahlbrecht, A. Alberti, D. Meschede, V. B. Scholz, A. H. Werner, and R. F.\nWerner.\nMolecular binding in interacting quantum walks.\nNew J. Phys., 14:073050, 2012.\nhttps://arxiv.org/abs/1105.1051arXiv:1105.1051.\n\nA. Ahlbrecht, C. Cedzich, R. Matjeschk, V. B. Scholz, A. H. Werner, and R. F.\nWerner.\nAsymptotic behavior of quantum walks with spatio-temporal coin\nfluctuations.\nQuantum Inf. Process., 11(5):1219-1249, 2012.\nhttps://arxiv.org/abs/1201.4839arXiv:1201.4839.\n\nA. Ahlbrecht, V. B. Scholz, and A. H. Werner.\nDisordered quantum walks in one lattice dimension.\nJ. Math. Phys., 52(10):102201, 48, 2011.\nhttps://arxiv.org/abs/1101.2298arXiv:1101.2298.\n\nA. Ahlbrecht, H. Vogts, A. H. Werner, and R. F. Werner.\nAsymptotic evolution of quantum walks with random coin.\nJ. Math. Phys., 52(4):042201, 36, 2011.\nhttps://arxiv.org/abs/1009.2019arXiv:1009.2019.\n\nA. Ambainis.\nQuantum walk algorithm for element distinctness.\nSIAM J. Comput., 37(1):210-239, 2007.\nhttps://arxiv.org/abs/quant-ph/0311001  arXiv:quant-ph/0311001.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1325-1335::c44",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1381-1436::c46",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1381-1436::c46",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1381,
    "end_line": 1436,
    "text": "A. Ambainis.\nQuantum walk algorithm for element distinctness.\nSIAM J. Comput., 37(1):210-239, 2007.\nhttps://arxiv.org/abs/quant-ph/0311001  arXiv:quant-ph/0311001.\n\nA. Ambainis, E. Bach, A. Nayak, A. Vishwanath, and J. Watrous.\nOne-dimensional quantum walks.\nIn Proceedings of the thirty-third annual ACM symposium on\nTheory of computing, pages 37-49. ACM, 2001.\n\nS. Aubry and G. Andre.\nAnalyticity breaking and Anderson localization in incommensurate\nlattices.\nIn Group theoretical methods in physics (Proc. Eighth\nInternat. Colloq., Kiryat Anavim, 1979), volume 3 of Ann.\nIsrael Phys. Soc., pages 133-164. Hilger, Bristol, 1980.\n\nA. Avila.\nLyapunov exponents, KAM and the spectral dichotomy for\none-frequency Schrodinger operators.\n\nA. Avila.\nOn point spectrum with critical coupling.\npreprint, 2008.\n\nA. Avila.\nAlmost reducibility and absolute continuity I.\n2010.\nhttps://arxiv.org/abs/1006.0704arXiv:1006.0704.\n\nA. Avila.\nGlobal theory of one-frequency Schrodinger operators.\nActa Math., 215(1):1-54, 2015.\nhttps://arxiv.org/abs/0905.3902arXiv:0905.3902.\n\nA. Avila, B. Fayad, and R. Krikorian.\nA KAM scheme for  cocycles with\nLiouvillean frequencies.\nGeom. Funct. Anal., 21(5):1001-1019, 2011.\nhttps://arxiv.org/abs/1001.2878arXiv:1001.2878.\n\nA. Avila and S. Jitomirskaya.\nThe ten Martini problem.\nAnn. Math., 170(1):303-342, 2009.\nhttps://arxiv.org/abs/math/0503363  arXiv:math/0503363.\n\nA. Avila and S. Jitomirskaya.\nAlmost localization and almost reducibility.\nJ. Eur. Math. Soc., 12(1):93-131, 2010.\nhttps://arxiv.org/abs/0805.1761arXiv:0805.1761.\n\nA. Avila, S. Jitomirskaya, and C. A. Marx.\nSpectral theory of extended Harper's model and a question by\nErdos and Szekeres.\nInvent. Math., 210(1):283-339, 2017.\nhttps://arxiv.org/abs/1602.05111  arXiv:1602.05111.\n\nA. Avila, S. Jitomirskaya, and C. Sadel.\nComplex one-frequency cocycles.\nJ. Eur. Math. Soc., 16(9):1915-1935, 2014.\nhttps://arxiv.org/abs/1306.1605arXiv:1306.1605.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1337-1379::c45",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1438-1486::c47",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1438-1486::c47",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1438,
    "end_line": 1486,
    "text": "A. Avila, S. Jitomirskaya, and C. Sadel.\nComplex one-frequency cocycles.\nJ. Eur. Math. Soc., 16(9):1915-1935, 2014.\nhttps://arxiv.org/abs/1306.1605arXiv:1306.1605.\n\nA. Avila and R. Krikorian.\nMonotonic cocycles.\nInvent. Math., 202:271-331, 2015.\nhttps://arxiv.org/abs/1310.0703arXiv:1310.0703.\n\nA. Avila, J. You, and Q. Zhou.\nSharp phase transitions for the almost Mathieu operator.\nDuke Math. J., 166(14):2697-2718, 2017.\nhttps://arxiv.org/abs/1512.03124  arXiv:1512.03124.\n\nJ. Bellissard.\nLe papillon de Hofstadter.\nAsterisque, 206:7-39, 1992.\n\nJ. Bellissard and B. Simon.\nCantor spectrum for the almost Mathieu equation.\nJ. Funct. Anal., 48(3):408-419, 1982.\n\nJ. Bourgain and M. Goldstein.\nOn nonperturbative localization with quasi-periodic potential.\nAnn. Math., 152(3):835-879, 2000.\nhttps://arxiv.org/abs/math-ph/0011053  arXiv:math-ph/0011053.\n\nJ. Bourgain, F. A. Grunbaum, L. Velazquez, and J. Wilkening.\nQuantum recurrence of a subspace and operator-valued Schur\nfunctions.\nCommun. Math. Phys., 329(3):1031-1067, 2014.\nhttps://arxiv.org/abs/1302.7286arXiv:1302.7286.\n\nO. Bourget, J. S. Howland, and A. Joye.\nSpectral analysis of unitary band matrices.\nCommun. Math. Phys., 243:191-227, 2003.\nhttps://arxiv.org/abs/math-ph/0204016  arXiv:math-ph/0204016.\n\nM.-J. Cantero, F. A. Grunbaum, L. Moral, and L. Velazquez.\nMatrix-valued Szego polynomials and quantum random walks.\nCommun. Pure Appl. Math., 63(4):464-507, 2010.\nhttps://arxiv.org/abs/0901.2244arXiv:0901.2244.\n\nM.-J. Cantero, F. A. Grunbaum, L. Moral, and L. Velazquez.\nThe CGMV method for quantum walks.\nQuantum Inf. Process., 11(5):1149-1192, 2012.\n\nC. Cedzich, , T. Geib, C. Stahl, L. Velazquez, A. H. Werner, and R. F.\nWerner.\nComplete homotopy invariants for translation invariant symmetric\nquantum walks on a chain.\nQuantum, 2:95, 2018.\nhttps://arxiv.org/abs/1804.04520  arXiv:1804.04520.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1381-1436::c46",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1488-1529::c48",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1488-1529::c48",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1488,
    "end_line": 1529,
    "text": "C. Cedzich, , T. Geib, C. Stahl, L. Velazquez, A. H. Werner, and R. F.\nWerner.\nComplete homotopy invariants for translation invariant symmetric\nquantum walks on a chain.\nQuantum, 2:95, 2018.\nhttps://arxiv.org/abs/1804.04520  arXiv:1804.04520.\n\nC. Cedzich, J. Fillman, T. Geib, and A. H. Werner.\nSingular continuous Cantor spectrum for magnetic quantum walks.\nLett. Math. Phys., 110:1141-1158, 2020.\nhttps://arxiv.org/abs/1908.09924  arXiv:1908.09924.\n\nC. Cedzich, J. Fillman, L. Li, D. Ong, and Q. Zhou.\nA unitary mosaic model with exact mobility edges.\nIn preparation, 2023.\n\nC. Cedzich, T. Geib, F. Grunbaum, L. Velazquez, A. Werner, and R. Werner.\nQuantum walks: Schur functions meet symmetry protected topological\nphases.\nCommun. Math. Phys., 389:31-74, 2022.\nhttps://arxiv.org/abs/1903.07494  arXiv:1903.07494.\n\nC. Cedzich, T. Geib, F. A. Grunbaum, C. Stahl, L. Velazquez, A. H. Werner,\nand R. F. Werner.\nThe topological classification of one-dimensional symmetric quantum\nwalks.\nAnn. Inst. H. Poincare, 19(2):325-383, 2018.\nhttps://arxiv.org/abs/1611.04439  arXiv:1611.04439.\n\nC. Cedzich, T. Geib, A. H. Werner, and R. F. Werner.\nQuantum walks in external gauge fields.\nJ. Math. Phys., 60(1):012107, 2019.\nhttps://arxiv.org/abs/1808.10850  arXiv:1808.10850.\n\nC. Cedzich, T. Geib, A. H. Werner, and R. F. Werner.\nChiral Floquet systems and quantum walks at half period.\nAnn. Inst. H. Poincare, 22(2):375-413, 2021.\nhttps://arxiv.org/abs/2006.04634  arXiv:2006.04634.\n\nC. Cedzich, T. Rybar, A. H. Werner, A. Alberti, M. Genske, and R. F. Werner.\nPropagation of quantum walks in electric fields.\nPhys. Rev. Lett., 111:160601, 2013.\nhttps://arxiv.org/abs/1302.2081arXiv:1302.2081.\n\nC. Cedzich and A. H. Werner.\nAnderson localization for electric quantum walks and skew-shift CMV\nmatrices.\nCommun. Math. Phys., 387:1257-1279, 2021.\nhttps://arxiv.org/abs/1906.11931  arXiv:1906.11931.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1438-1486::c47",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1531-1578::c49",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1531-1578::c49",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1531,
    "end_line": 1578,
    "text": "C. Cedzich and A. H. Werner.\nAnderson localization for electric quantum walks and skew-shift CMV\nmatrices.\nCommun. Math. Phys., 387:1257-1279, 2021.\nhttps://arxiv.org/abs/1906.11931  arXiv:1906.11931.\n\nH. L. Cycon, R. G. Froese, W. Kirsch, and B. Simon.\nSchrodinger operators with application to quantum mechanics\nand global geometry.\nTexts and Monographs in Physics. Springer-Verlag, Berlin, 1987.\n\nD. Damanik.\nAlmost everything about the Fibonacci operator.\nIn XVth International Congress of Mathematical\nPhysics, pages 149-159. 2009.\n\nD. Damanik, J. Erickson, J. Fillman, G. Hinkle, and A. Vu.\nQuantum intermittency for sparse CMV matrices with an application\nto quantum walks on the half-line.\nJ. Approx. Theory, 208:59-84, 2016.\nhttps://arxiv.org/abs/1507.02041  arXiv:1507.02041.\n\nD. Damanik, J. Fillman, and D. C. Ong.\nSpreading estimates for quantum walks on the integer lattice via\npower-law bounds on transfer matrices.\nJ. Math. Pures Appl., 105(3):293-341, 2016.\nhttps://arxiv.org/abs/1505.07292  arXiv:1505.07292.\n\nD. Damanik, S. Guo, and D. C. Ong.\nSubordinacy theory for extended CMV matrices.\nSci. China Math., 64, 2021.\nhttps://arxiv.org/abs/2005.04696  arXiv:2005.04696.\n\nF. Delyon.\nAbsence of localisation in the almost Mathieu equation.\nJ. Phys. A, 20(1):L21-L23, 1987.\n\nJ. Fillman.\nPurely singular continuous spectrum for Sturmian CMV matrices via\nstrengthened Gordon lemmas.\nProc. Amer. Math. Soc., 145(1):225-239, 2017.\nhttps://arxiv.org/abs/1507.02044  arXiv:1507.02044.\n\nJ. Fillman and D. C. Ong.\nA condition for purely absolutely continuous spectrum for CMV\noperators using the density of states.\nProc. Amer. Math. Soc., 146(2):571-580, 2018.\nhttps://arxiv.org/abs/1612.03208  arXiv:1612.03208.\n\nJ. Fillman, D. C. Ong, and Z. Zhang.\nSpectral characteristics of the unitary critical almost-Mathieu\noperator.\nCommun. Math. Phys., 351:525-561, 2017.\nhttps://arxiv.org/abs/1512.07641  arXiv:1512.07641.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1488-1529::c48",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1580-1630::c50",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1580-1630::c50",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1580,
    "end_line": 1630,
    "text": "J. Fillman, D. C. Ong, and Z. Zhang.\nSpectral characteristics of the unitary critical almost-Mathieu\noperator.\nCommun. Math. Phys., 351:525-561, 2017.\nhttps://arxiv.org/abs/1512.07641  arXiv:1512.07641.\n\nJ. S. Geronimo and R. A. Johnson.\nRotation number associated with difference equations satisfied by\npolynomials orthogonal on the unit circle.\nJ. Differ. Equations, 132(1):140-178, 1996.\n\nF. Gesztesy and M. Zinchenko.\nWeyl-Titchmarsh theory for CMV operators associated with\northogonal polynomials on the unit circle.\nJ. Approx. Theory, 139(1-2):172-213, 2006.\nhttps://arxiv.org/abs/math/0501210  arXiv:math/0501210.\n\nG. Grimmett, S. Janson, and P. F. Scudo.\nWeak limits for quantum random walks.\nPhys. Rev. E, 69(2):026119, 2004.\nhttps://arxiv.org/abs/quant-ph/0309135  arXiv:quant-ph/0309135.\n\nR. Han.\nAbsence of point spectrum for the self-dual extended Harper's\nmodel.\nInt. Math. Res. Not. IMRN, 2018(9):2801-2809, 2018.\nhttps://arxiv.org/abs/1909.03995  arXiv:1909.03995.\n\nM. Herman.\nUne methode pour minorer les exposants de Lyapounov et quelques\nexemples montrant le caractere local d'un theoreme d' Arnold et de\nMoser sur le tore de dimension 2.\nComment. Math. Helv., 58:453-502, 1983.\n\nD. R. Hofstadter.\nEnergy levels and wave functions of Bloch electrons in rational and\nirrational magnetic fields.\nPhys. Rev. B, 14:2239-2249, 1976.\n\nS. Jitomirskaya.\nMetal-insulator transition for the almost Mathieu operator.\nAnn. Math., 150(3):1159-1175, 1999.\nhttps://arxiv.org/abs/math/9911265  arXiv:math/9911265.\n\nS. Jitomirskaya.\nOn point spectrum of critical almost Mathieu operators.\nAdv. Math., 392:107997, 2021.\n\nS. Jitomirskaya and S. Kocic.\nSpectral theory of Schrodinger operators over circle\ndiffeomorphisms.\nInt. Math. Res. Not., 2022(13):9810-9829, 2021.\n\nS. Jitomirskaya and W. Liu.\nArithmetic spectral transitions for the Maryland model.\nCommun. Pure Appl. Math., 70(6):1025-1051, 2017.\nhttps://arxiv.org/abs/1611.10027  arXiv:1611.10027.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1531-1578::c49",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1632-1677::c51",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1632-1677::c51",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1632,
    "end_line": 1677,
    "text": "S. Jitomirskaya and W. Liu.\nArithmetic spectral transitions for the Maryland model.\nCommun. Pure Appl. Math., 70(6):1025-1051, 2017.\nhttps://arxiv.org/abs/1611.10027  arXiv:1611.10027.\n\nS. Jitomirskaya and W. Liu.\nUniversal hierarchical structure of quasiperiodic eigenfunctions.\nAnn. Math., 187(3):721-776, 2018.\nhttps://arxiv.org/abs/1609.08664  arXiv:1609.08664.\n\nS. Jitomirskaya and C. A. Marx.\nAnalytic quasi-perodic cocycles with singularities and the Lyapunov\nexponent of extended Harper's model.\nCommun. Math. Phys., 316(1):237-267, 2012.\nhttps://arxiv.org/abs/1010.0751arXiv:1010.0751.\n\nS. Jitomirskaya and C. A. Marx.\nErratum to: Analytic quasi-perodic cocycles with singularities and\nthe Lyapunov exponent of extended Harper's model.\nCommun. Math. Phys., 317(1):269-271, 2013.\n\nS. Y. Jitomirskaya.\nAlmost everything about the almost Mathieu operator. II.\nIn XIth International Congress of Mathematical Physics\n(Paris, 1994), pages 373-382. Int. Press, Cambridge, MA, 1995.\n\nA. Joye.\nDynamical localization for d-dimensional random quantum walks.\nQuantum Inf. Process., 11(5):1251-1269, Oct 2012.\nhttps://arxiv.org/abs/1201.4759arXiv:1201.4759.\n\nA. Joye and M. Merkli.\nDynamical localization of quantum walks in random environments.\nJ. Stat. Phys., 140(6):1-29, 2010.\nhttps://arxiv.org/abs/1004.4130arXiv:1004.4130.\n\nT. Kitagawa, M. S. Rudner, E. Berg, and E. Demler.\nExploring topological phases with quantum walks.\nPhys. Rev. A, 82(3):033429, 2010.\nhttps://arxiv.org/abs/1003.1729arXiv:1003.1729.\n\nT. Komatsu, N. Konno, H. Morioka, and E. Segawa.\nGeneralized eigenfunctions for quantum walks via path counting\napproach.\nRev. Math. Phys., 33(06):2150019, 2021.\nhttps://arxiv.org/abs/2009.03498  arXiv:2009.03498.\n\nY. Last.\nAlmost everything about the almost Mathieu operator. I.\nIn XIth International Congress of Mathematical Physics\n(Paris, 1994), pages 366-372. Int. Press, Cambridge, MA, 1995.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1580-1630::c50",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1679-1731::c52",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1679-1731::c52",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1679,
    "end_line": 1731,
    "text": "Y. Last.\nAlmost everything about the almost Mathieu operator. I.\nIn XIth International Congress of Mathematical Physics\n(Paris, 1994), pages 366-372. Int. Press, Cambridge, MA, 1995.\n\nR. B. Laughlin.\nQuantized Hall conductivity in two dimensions.\nPhys. Rev. B, 23(10):5632, 1981.\n\nL. Li, D. Damanik, and Q. Zhou.\nAbsolutely continuous spectrum for CMV matrices with small\nquasi-periodic Verblunsky coefficients.\nTrans. Amer. Math. Soc., 375(9):6093-6125, 2022.\nhttps://arxiv.org/abs/2102.00586  arXiv:2102.00586.\n\nN. Linden and J. Sharam.\nInhomogeneous quantum walks.\nPhys. Rev. A, 80(5):052327, 2009.\nhttps://arxiv.org/abs/0906.3692arXiv:0906.3692.\n\nN. B. Lovett, S. Cooper, M. Everitt, M. Trevers, and V. Kendon.\nUniversal quantum computation using the discrete-time quantum walk.\nPhys. Rev. A, 81(4):042330, 2010.\nhttps://arxiv.org/abs/0910.1024arXiv:0910.1024.\n\nV. A. Mandel'shtam and S. Y. Zhitomirskaya.\nD-quasiperiodic operators. Latent symmetries.\nCommun. Math. Phys., 139(3):589-604, 1991.\n\nC. A. Marx and S. Jitomirskaya.\nDynamics and spectral theory of quasi-periodic Schrodinger-type\noperators.\nErgodic Theory Dynam. Systems, 37(8):2353-2393, 2017.\nhttps://arxiv.org/abs/1503.05740  arXiv:1503.05740.\n\nH. Morioka and E. Segawa.\nDetection of edge defects by embedded eigenvalues of quantum walks.\nQuantum Inf. Process., 18(9):1-18, 2019.\nhttps://arxiv.org/abs/1805.11742  arXiv:1805.11742.\n\nL. A. Pastur.\nSpectral properties of disordered systems in the one-body\napproximation.\nCommun. Math. Phys., 75(2):179-196, 1980.\n\nR. Portugal.\nQuantum walks and search algorithms.\nSpringer, 2013.\n\nJ. Puig.\nCantor spectrum for the almost Mathieu operator.\nCommun. Math. Phys., 244(2):297-309, 2004.\nhttps://arxiv.org/abs/math-ph/0309004  math-ph/0309004.\n\nM. Reed and B. Simon.\nMethods of modern mathematical physics. IV. Analysis of\noperators.\nAcademic Press, New York-London, 1978.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1632-1677::c51",
        "direction": "previous"
      },
      {
        "id": "2112.03216v2::L1733-1784::c53",
        "direction": "next"
      }
    ]
  },
  {
    "id": "2112.03216v2::L1733-1784::c53",
    "file": "data/data/full_text/2112.03216v2.txt",
    "section_path": "",
    "start_line": 1733,
    "end_line": 1784,
    "text": "M. Reed and B. Simon.\nMethods of modern mathematical physics. IV. Analysis of\noperators.\nAcademic Press, New York-London, 1978.\n\nN. Shenvi, J. Kempe, and R. B. Whaley.\nA quantum walk search algorithm.\nPhys. Rev. A, 67, 2003.\nhttps://arxiv.org/abs/quant-ph/0210064  arXiv:quant-ph/0210064.\n\nY. Shikano and H. Katsura.\nLocalization and fractality in inhomogeneous quantum walks with\nself-duality.\nPhys. Rev. E., 82(3):031122, 2010.\nhttps://arxiv.org/abs/1004.5394arXiv:1004.5394.\n\nM. A. Shubin.\nDiscrete magnetic Laplacian.\nCommun. Math. Phys., 164(2):259-275, 1994.\n\nB. Simon.\nOrthogonal polynomials on the unit circle. Part 1, volume 54\nof American Mathematical Society Colloquium Publications.\nAmerican Mathematical Society, Providence, RI, 2005.\nClassical theory.\n\nB. Simon.\nOrthogonal polynomials on the unit circle. Part 2, volume 54\nof American Mathematical Society Colloquium Publications.\nAmerican Mathematical Society, Providence, RI, 2005.\nSpectral theory.\n\nD. J. Thouless, M. Kohmoto, M. P. Nightingale, and M. Den Nijs.\nQuantized Hall conductance in a two-dimensional periodic potential.\nPhys. Rev. Lett., 49(6):405, 1982.\n\nF. Wang and D. Damanik.\nAnderson localization for quasi-periodic CMV matrices and quantum\nwalks.\nJ. Funct. Anal., 276(6):1978-2006, 2019.\nhttps://arxiv.org/abs/1804.00301  arXiv:1804.00301.\n\nS. Weidemann, M. Kremer, S. Longhi, and A. Szameit.\nTopological triple phase transition in non-Hermitian Floquet\nquasicrystals.\nNature, 601(7893):354-359, 2022.\n\nF. Yang.\nLocalization for magnetic quantum walks.\n2022.\nhttps://arxiv.org/abs/2201.05779  arXiv:2201.05779.\n\nZ. Zhang.\nPositive Lyapunov exponents for quasiperiodic Szego\ncocycles.\nNonlinearity, 25(6):1771-1797, 2012.\nhttps://arxiv.org/abs/1204.2234arXiv:1204.2234.",
    "labels": [],
    "refs": [],
    "meta": {
      "source": "plain_text"
    },
    "neighbors": [
      {
        "id": "2112.03216v2::L1679-1731::c52",
        "direction": "previous"
      }
    ]
  }
]